[
  {
    "title": "Pawan Kalyan's Language Clash Sparks Political Drama",
    "link": "https://www.hindustantimes.com/india-news/dmk-leader-pawan-kalyans-tamil-films-dubbed-in-hindi-remark-he-wasnt-even-born-when-101742033229510.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Tamil-Nadu-Hindi-row-DMK-TKS-Elangovan_1742033887644_1742033887888.png",
    "provider": "Hindustan Times",
    "rawdes": "In response to actor-turned-politician Pawan Kalyan’s ‘movie dubbing’ remarks on the ongoing Hindi language row in Tamil Nadu, leader of ruling DMK, TKS Elangovan, accused him of hypocrisy saying that “he doesn't know anything about state politics.”The exchange comes amid rising controversy over the three-language issue under the National Education Policy (NEP) 2020.Pawan Kalyan, who is also the deputy chief minister of Andhra Pradesh, criticised the Tamil Nadu politicians for what he called ",
    "news": {
      "key_points": [
        "Pawan Kalyan criticized Tamil Nadu politicians over language issues.",
        "TKS Elangovan accused Kalyan of hypocrisy and ignorance of state politics.",
        "The controversy centers around the three-language policy in NEP 2020."
      ],
      "detailed_points": [
        "Pawan Kalyan made comments regarding the Hindi language row in Tamil Nadu.",
        "He specifically targeted Tamil Nadu politicians for their stance on language issues.",
        "TKS Elangovan, a DMK leader, responded by accusing Kalyan of being hypocritical.",
        "Elangovan suggested Kalyan lacks understanding of the complexities of state politics.",
        "The debate is part of a larger controversy regarding the National Education Policy's language provisions."
      ],
      "genz_version": "Yo, so Pawan Kalyan just threw shade at Tamil Nadu politicos over that Hindi debate, right? DMK's TKS Elangovan clapped back, calling him a total hypocrite and saying he’s clueless about the local scene. This whole drama is part of the bigger deal with the 3-language rule in NEP 2020. It’s getting spicy out there!",
      "paragraph": "Actor-turned-politician Pawan Kalyan has provoked controversy by criticizing Tamil Nadu politicians over the ongoing Hindi language debate. In response, DMK leader TKS Elangovan accused Kalyan of hypocrisy, claiming he is out of touch with state politics. This exchange highlights the rising tensions regarding the three-language policy outlined in the National Education Policy 2020."
    }
  },
  {
    "title": "Drunk Driver's Reckless Crash Claims Life in Vadodara",
    "link": "https://www.hindustantimes.com/india-news/vadodara-car-crash-congress-liquor-availability-dry-state-gujarat-rakshit-chaurasia-101742031474006.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/vadodara_car_crash_political_reactions_1742031873167_1742031886416.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Vadodara car crash: A woman was killed and four others were left injured after a 23-year-old law student, Rakshit Ravish Chaurasia, allegedly crashed a car into several vehicles in Gujarat's Vadodara in the early hours of Friday. The incident sparked outrage among not only netizens, but in the political circuit as well.Chaurasia, who was allegedly in an inebriated state at the time of the accident, denied being drunk. He told the police that he lost control of the car at a speed of 50 kmph when he lost control of the vehicle due to potholes on the road.Eyewitnesses, who caught the 23-year-old, also told cops that he appeared to be drunk and was screaming 'another round, another round' after coming out of the car following the crash.ALSO READ | What police revealed about Rakshit Chaurasia who mowed down woman in Vadodara car crashThis has led to several questions, with many wondering how the accused managed to be in an inebriated state in the dry state. Congress leader Supriya Shrinate, in a post on X, condemned the accident and condoled the loss of the woman's life in it.She asked as to what as happened to boys like Rakshit Chaurasia, ",
    "news": {
      "key_points": [
        "A woman was killed and four injured in Vadodara car crash.",
        "Accused law student Rakshit Chaurasia allegedly drove under the influence.",
        "Eyewitnesses reported Chaurasia was intoxicated despite Gujarat's dry laws."
      ],
      "detailed_points": [
        "The tragic incident occurred early Friday morning, resulting in one fatality and multiple injuries.",
        "Rakshit Chaurasia, a 23-year-old law student, claimed he lost control due to potholes while driving at 50 km/h.",
        "Eyewitness accounts suggest Chaurasia was intoxicated, as he reportedly yelled about wanting another drink post-crash.",
        "Political figures, including Congress leader Supriya Shrinate, condemned the incident and expressed condolences.",
        "Concerns have been raised about how Chaurasia was inebriated in a state where alcohol is prohibited."
      ],
      "genz_version": "OMG, so like, a total bummer went down in Vadodara! This 23-year-old law dude, Rakshit, totally crashed his car and ended up taking a woman’s life, plus injured four others. He claimed he lost control 'cause of potholes, but peeps say he was lit af, yelling about another drink after the wreck. Everyone is shook, like, how's he getting drunk in a dry state? That's sus! #RIP #NotCool",
      "paragraph": "A tragic car crash in Vadodara resulted in the death of a woman and injuries to four others. The driver, 23-year-old law student Rakshit Chaurasia, allegedly lost control of his vehicle while intoxicated, sparking outrage and concerns about the incident, especially given Gujarat's alcohol prohibition. Eyewitnesses reported him screaming about wanting another drink following the crash, raising questions about the enforcement of dry laws."
    }
  },
  {
    "title": "Ranya Rao's Gold Smuggling U-Turn Shocks Fans",
    "link": "https://www.hindustantimes.com/entertainment/others/ranya-rao-now-pleads-innocence-says-she-was-slapped-by-officers-whom-she-can-identify-report-101742030231692.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/ranya_rao_bengaluru_1741310015012_1742030406477.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Kannada actor Ranya Rao has taken a u-turn on her statement. As per a new report in India Today, she has a letter to the Additional Director General of DRI and maintained her innocence in the gold smuggling case. Last week, she had admitted to the crime.Ranya Rao alleges assault by DRI officersAs per the letter, she was arrested from the airplane itself two weeks ago. She alleged that despite being assaulted multiple times, she resisted signing the statements drafted by DRI officers. However, the actor claimed that under intense pressure, she was ultimately compelled to sign approximately 50 to 60 typed pages along with 40 blank sheets. HT could not independently verify the mentioned letter.",
    "news": {
      "key_points": [
        "Ranya Rao initially confessed to gold smuggling.",
        "She now claims innocence, alleging DRI officer assault.",
        "Rao signed under pressure, including blank pages."
      ],
      "detailed_points": [
        "Ranya Rao, a Kannada actor, changed her stance on a gold smuggling case after initially admitting guilt.",
        "She alleged in a letter to the DRI's Additional Director General that she was assaulted during her arrest.",
        "Rao claims she was coerced into signing 50-60 pages of statements, including 40 blank sheets.",
        "The incident occurred two weeks ago when she was arrested on an airplane.",
        "The authenticity of the letter has not been independently verified."
      ],
      "genz_version": "So, like, Ranya Rao just did a total 180 on that gold smuggling drama. She admitted to it at first, but now she’s all 'I’m innocent!' and saying the DRI peeps assaulted her when they arrested her on the plane. She was basically forced to sign a mountain of papers, even some blank ones! What’s up with that? This is wild fam! #JusticeForRanya",
      "paragraph": "Kannada actor Ranya Rao has reversed her confession in a gold smuggling case, now asserting her innocence in a letter to the DRI. She claims she was assaulted during her arrest two weeks ago and felt pressured to sign extensive statements, including blank pages. The situation has raised serious concerns over the conduct of DRI officers and the validity of her previous admission."
    }
  },
  {
    "title": "Tragic Family Incident Shocks Andhra Pradesh",
    "link": "https://www.hindustantimes.com/india-news/andhra-pradesh-ongc-employee-kills-kids-academic-failure-suicide-kakinada-bucket-101742032319834.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Accident-or-crime-scene-cordon-tape--police-line-d_1694183727052_1742032669402.jpg",
    "provider": "Hindustan Times",
    "rawdes": "In a shocking case, a 37-year-old Oil and Natural Gas Corporation (ONGC) employee died by suicide after killing his two sons in Andhra Pradesh's Kakinada, reportedly due to their poor academic performance.Police said that the man drowned his boys in a bucket of water, having been deeply disappointed with their academic results on Friday, according to a news agency PTI report.The man's wife found him hanging in the bedroom, while her children were found lifeless in a bucket, the report said.The incident took place at around 10 am on Friday, police said.'Man feared kids would struggle in academics'The man killed his sons because of their poor academic performance, said an official, cited in the PTI report. The man feared that the kids “would struggle and suffer in a competitive world if they did not excel in their studies”. Unable to bear this thought, he took the extreme step.",
    "news": {
      "key_points": [
        "A 37-year-old ONGC employee died by suicide.",
        "He drowned his two sons due to their poor academic performance.",
        "The incident took place in Kakinada, Andhra Pradesh."
      ],
      "detailed_points": [
        "The father was reportedly deeply disappointed in his children's academic results.",
        "He feared they would struggle in a competitive world without good grades.",
        "The tragedy unfolded on a Friday morning around 10 am.",
        "His wife discovered him hanging in their bedroom.",
        "This heartbreaking incident raises concerns about academic pressure on children."
      ],
      "genz_version": "Yo, so in Kakinada, a dad from ONGC legit lost it over his kids’ grades. He thought they were gonna struggle in life, so he did the unthinkable and drowned them in a bucket 🪣. Then, he hung himself. Like, what a total nightmare 😢. This really shows how wild the pressure for good grades can be, fam. Stay strong, everyone! 💔",
      "paragraph": "In a heartbreaking incident in Kakinada, Andhra Pradesh, a 37-year-old employee of ONGC died by suicide after allegedly drowning his two sons, driven by disappointment over their academic performance. The tragic events unfolded on a Friday morning, leading to a profound family crisis, highlighting the severe pressure that academic success can impose on families."
    }
  },
  {
    "title": "West Bengal Clashes Trigger Internet Shutdown",
    "link": "https://www.hindustantimes.com/india-news/violence-in-west-bengals-birbhum-after-holi-clash-internet-suspended-bjp-slams-tmc-101742030092277.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/West_Bengal-Birbhum-violence_1742030567519_1742030568070.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Tensions escalated in West Bengal's Birbhum on Saturday after violent clashes between two groups led to the suspension of the internet in parts of town. The state government also deployed a huge contingent of security forces to maintain law and order.According to officials, internet and voice-over-internet telephony services were suspended in at least five Gram Panchayat areas of Sainthia town in West Bengal's Birbhum district to prevent the spread of rumours and unlawful activities.The shutdown is in effect from March 14 to March 17.The order further states that no restriction is being placed on voice calls or SMS. Similarly, no restrictions on newspapers have been placed, adding ",
    "news": {
      "key_points": [
        "Clashes between two groups in Birbhum escalated tensions.",
        "Internet services suspended in five areas from March 14 to 17.",
        "Authorities deployed security forces to maintain order."
      ],
      "detailed_points": [
        "Violent clashes occurred between rival groups in Sainthia town.",
        "The West Bengal government suspended internet and VoIP services to curb misinformation.",
        "The shutdown is effective from March 14 until March 17.",
        "No restrictions on voice calls or SMS were imposed.",
        "Security forces were deployed to ensure law and order amidst the unrest."
      ],
      "genz_version": "Yo, so Birbhum in West Bengal is totally lit right now – like, clashes between two squads made the internet go bye-bye in Sainthia from March 14-17. The gov's sending in mad security to keep things chill. No worries though, you can still hit up your friends via SMS or calls. Stay safe fam! #BirbhumChaos",
      "paragraph": "Tensions in West Bengal's Birbhum district heightened due to violent clashes between two groups, prompting the state government to suspend internet and VoIP services in Sainthia from March 14 to March 17. This measure aims to prevent the spread of rumors, while security forces have been deployed to maintain law and order. Voice calls and SMS services remain operational."
    }
  },
  {
    "title": "Trump Orders DC Cleanup Before World Leaders Visit",
    "link": "https://www.hindustantimes.com/world-news/us-news/donald-trump-says-did-not-want-pm-narendra-modi-to-see-tents-graffiti-potholes-in-washington-dc-101742028252574.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/US-President-Donald-Trump-shakes-hands-with-Indian_1742029673171_1742029681196.jpg",
    "provider": "Hindustan Times",
    "rawdes": "US President Donald Trump said he did not want Prime Minister Narendra Modi and other world leaders who visited him to see the tents, graffiti and potholes near federal buildings in Washington DC, and ordered the cleaning up of the American capital.",
    "news": {
      "key_points": [
        "Trump expressed concern about DC's appearance for visiting leaders.",
        "He specifically mentioned issues like tents, graffiti, and potholes.",
        "A directive was issued to clean up the capital city."
      ],
      "detailed_points": [
        "US President Trump aimed to improve the aesthetics of Washington DC.",
        "He was particularly worried about the impressions on foreign leaders, including PM Modi.",
        "The areas of concern included federal buildings and their surroundings.",
        "By addressing these issues, Trump hopes to enhance diplomatic relations.",
        "The cleanup effort reflects broader concerns about urban maintenance."
      ],
      "genz_version": "Yo fam, Trump’s not vibing with how DC looks—tents and graffiti everywhere, plus potholes like it's a meme. He’s lowkey stressed that world leaders, like PM Modi, might peep all that when they roll through. So he’s like, ‘Let’s fix this ASAP!’ Gonna clean up the capital to keep it lit for the squad.",
      "paragraph": "US President Donald Trump has ordered a cleanup of Washington DC, expressing concerns about the appearance of the city for visiting world leaders, including Prime Minister Narendra Modi. Issues highlighted include tents, graffiti, and potholes near federal buildings, with the directive aimed at ensuring a more positive impression during visits."
    }
  },
  {
    "title": "Moeen Ali Questions Pakistan's Pace Legacy",
    "link": "https://www.hindustantimes.com/cricket/theres-perception-that-pakistan-has-best-seamers-no-englands-world-cup-winner-crushes-shaheen-haris-naseem-myth-101742022585875.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Shaheen_Naseem_Rauf_1740404617954_1742026405140.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Moeen Ali has cast doubt over the widely-held perception that Pakistan possesses one of the best fast-bowling trio in world cricket. The former England all-rounder believes that while Shaheen Afridi, Haris Rauf, and Naseem Shah are talented, they do not rank among the absolute best in the game today.His remarks come in the aftermath of Pakistan’s disappointing Champions Trophy 2025 campaign, where they crashed out in the group stage.Speaking on a podcast alongside Adil Rashid, Moeen questioned whether Pakistan’s pace unit truly deserves its lofty reputation.",
    "news": {
      "key_points": [
        "Moeen Ali doubts Pakistan's fast-bowling trio's reputation.",
        "He spoke after Pakistan's poor Champions Trophy 2025 performance.",
        "Ali believes Afridi, Rauf, and Shah aren't the best in cricket."
      ],
      "detailed_points": [
        "Moeen Ali, a former England all-rounder, expressed skepticism about the strength of Pakistan's fast-bowling lineup.",
        "His comments followed Pakistan's disappointing exit from the 2025 Champions Trophy in the group stage.",
        "Ali was speaking on a podcast, questioning the team's pace unit's standing in world cricket.",
        "He acknowledged the talent of Shaheen Afridi, Haris Rauf, and Naseem Shah.",
        "However, he felt they do not rank among the top bowlers currently."
      ],
      "genz_version": "Yo, Moeen Ali just threw some shade on Pakistan's pace squad, saying they're not all that after their flop show at the Champions Trophy 2025. On a podcast with Adil Rashid, he was like, 'Sure, Afridi, Rauf, and Shah got skills, but they ain't the GOATs of fast bowling!' Major doubt vibes, for real.",
      "paragraph": "Moeen Ali has raised doubts about the reputation of Pakistan's fast-bowling trio—Shaheen Afridi, Haris Rauf, and Naseem Shah—following their disappointing Champions Trophy 2025 campaign. In a podcast with Adil Rashid, he acknowledged their talent but asserted that they do not belong to the elite ranks in world cricket today."
    }
  },
  {
    "title": "Intel's New CEO: $69 Million Salary Unveiled!",
    "link": "https://www.hindustantimes.com/business/intels-new-ceo-tan-to-get-600-crore-a-ye-who-is-he-and-what-makes-up-his-pay-101742019375521.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Intel_logo_1742019776452_1742019776694.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Lip-Bu Tan, who was named Intel's new CEO this week, will be paid a salary of $69 million (about ₹600 crore) per year, provided he reaches targets over the coming years.Tan's pay package includes a salary of $1 million along with a 200 per cent performance-based bonus, Intel said in a filing on Friday. The pay package for the new CEO also includes $66 million in long-term equity awards and stock options and new-hire incentives.Also read: How did a Zambian river 'die' overnight due to a Chinese company? | Full detailsLip-Bu Tan has also agreed to buy Intel shares worth $25 million in the first 30 days of taking the job. “Lip-Bu’s purchase reflects his belief in Intel and commitment to creating shareholder value,” the company said in a statement.Tan was appointed as Intel's CEO after the company's board ousted his predecessor Pat Gelsinger. The former CEO was reportedly forced out less than four years after his appointment.He had resigned on December 1, 2024 after a board meeting last week during which directors felt Gelsinger's costly and ambitious plan to turn Intel around was not working and the progress of change was not fast enough.Also read: Indian govt issues urgent warning for Google Chrome users over high-risk vulnerabilitiesWho is Intel's new CEO Lip-Bu Tan?Tan is a longtime technology investor and widely respected executive with more than 20 years of semiconductor and software experience as well as deep relationships across Intel’s ecosystem.He served as CEO of Cadence Design Systems from 2009 to 2021, where he led a reinvention of the company and drove a cultural transformation centered on customer-centric innovation. During his time as CEO, Cadence more than doubled its revenue, expanded operating margins and delivered a stock price appreciation of more than 3,200 per cent.Tan served as a member of the Cadence board of directors for 19 years, from his appointment in 2004 through his service as executive chairman from 2021 to 2023 following his tenure as CEO.Also read: LVMH's Bernard Arnault could lead till 85 as company proposes raising CEO age limitHe is also a founding managing partner of Walden Catalyst Ventures and chairman of Walden International. He has significant public company board experience, currently serving on the boards of Credo Technology Group and Schneider Electric.Tan holds a Bachelor of Science in physics from Nanyang Technological University in Singapore, a Master of Science in nuclear engineering from the Massachusetts Institute of Technology and an MBA from the University of San Francisco.In 2022, he received the Robert N Noyce Award, the Semiconductor Industry Association’s highest honor.",
    "news": {
      "key_points": [
        "Lip-Bu Tan appointed Intel's new CEO with a salary of $69 million per year.",
        "Tan's pay package includes $1 million base salary and performance-based bonuses.",
        "He previously led Cadence Design Systems, significantly boosting its revenue and stock performance."
      ],
      "detailed_points": [
        "Lip-Bu Tan's total compensation could reach $69 million if performance targets are met.",
        "The package comprises a $1 million salary, a 200% performance bonus, and $66 million in equity awards.",
        "Tan's commitment includes purchasing $25 million in Intel shares shortly after his appointment.",
        "He replaces Pat Gelsinger, who was ousted after an unsuccessful turnaround plan.",
        "Tan brings over 20 years of experience in technology and semiconductor sectors."
      ],
      "genz_version": "OMG, Intel just dropped a bomb with Lip-Bu Tan as the new CEO, and he’s raking in a whopping $69 million if he hits those goals 🤯! He’s got a chill $1 million base, plus he’s all in with a $25 million share buy. Gotta say, the last guy got the boot for not vibing with the turnaround plan. Tan’s a total boss with mad experience—can't wait to see what he cooks up! 💸🔥",
      "paragraph": "Intel has appointed Lip-Bu Tan as its new CEO with a substantial pay package that could total $69 million annually. This includes a $1 million salary, significant performance bonuses, and long-term equity awards. Tan, a seasoned tech executive, previously transformed Cadence Design Systems, and has pledged to purchase $25 million worth of Intel shares to demonstrate his confidence in the company."
    }
  },
  {
    "title": "Aamir Khan's Girlfriend Steals the Show!",
    "link": "https://www.hindustantimes.com/entertainment/bollywood/aamir-khan-s-girlfriend-gauri-spratt-stuns-in-new-picture-from-his-pre-birthday-meet-101742033448435.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Aamir_Khan_girlfriend_1742033712951_1742033713250.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Bollywood star Aamir Khan stunned everyone by introducing his girlfriend, Gauri Spratt, to the media at this pre-birthday meet and greet last week at a hotel in Mumbai. Now, a new picture of Gauri has emerged on social media, giving a glimpse of her at the actor's pre-birthday celebration in Mumbai. Also read: Who is Gauri Spratt, Aamir Khan's girlfriend? Mom of 6-year-old, owns a salon in MumbaiGauri Spratt steals the spotlight in new photoOn Saturday, a new image of Gauri surfaced on Instagram, sending fans into a frenzy. In the photograph, Gauri exudes elegance as she wears a beautiful lavender kurta, perfectly paired with black leggings. Her smile lights up the frame as she beams with joy, posing effortlessly for the camera.Aamir's fans were overjoyed as they caught a glimpse of Gauri's new photo.",
    "news": {
      "key_points": [
        "Aamir Khan publicly introduces girlfriend Gauri Spratt.",
        "New photo of Gauri at Aamir's pre-birthday event goes viral.",
        "Gauri received praise for her elegant appearance in a lavender kurta."
      ],
      "detailed_points": [
        "Bollywood superstar Aamir Khan revealed his girlfriend, Gauri Spratt, at a pre-birthday event in Mumbai.",
        "A new image of Gauri was shared on social media, showcasing her joyful demeanor.",
        "Gauri wore a stylish lavender kurta and black leggings at the celebration.",
        "Fans expressed excitement and admiration for Gauri on various platforms.",
        "Gauri is a mother of a 6-year-old and owns a salon in Mumbai."
      ],
      "genz_version": "OMG, guys! 🎉 Aamir Khan just dropped the biggest reveal—he's dating Gauri Spratt! 😍 At his pre-bday bash in Mumbai, pics of Gauri lit up Insta, and she looked fire in a lavender kurta! 💜✨ The world can't handle her vibe, and fans are totally living for this new couple alert! #AamirAndGauri #SquadGoals",
      "paragraph": "Bollywood actor Aamir Khan surprised fans by introducing his girlfriend, Gauri Spratt, during a pre-birthday event in Mumbai. Recently, a photo of Gauri wearing a lovely lavender kurta surfaced online, capturing the attention of many. Her radiant smile and stylish outfit delighted Aamir's fans, offering a sneak peek into their celebration."
    }
  },
  {
    "title": "Nolan's Epic Odyssey: No Green Screens Allowed!",
    "link": "https://www.hindustantimes.com/entertainment/hollywood/internet-impressed-with-christopher-nolan-for-shooting-the-odyssey-on-real-location-without-cgi-101742030768107.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Christopher_Nolan_1737454651423_1742030974129.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Christopher Nolan is currently busy with the shoot of his next film The Odyssey. Several pictures of the shoot emerged on the internet, where the director was seen with Tom Holland and other extras dressed as warriors on a boat in Greece. The shoot took place on a wooden ship in the sea outside of Methoni, Greece. A fan took to Instagram to share how impressive it is that Nolan chose to film in a live location when he could have easily taken the easy route and done it inside a studio with green screens instead. (Also read: Leaked pics from Christopher Nolan's The Odyssey set reveal Tom Holland's look; internet spots historical inaccuracies)Christopher Nolan shoots The OdysseyA fan took to Instagram to comment on Nolan's decision to shoot The Odyssey on location and said, “It is rare to see things like this in modern movie blockbusters. If you notice anything about these pictures, they have no green screens! No CGI! This man built a boat, put it in the ocean and filmed scenes! With the film reportedly having a 250 million budget, stuff like this is so unheard of nowadays. They would normally build a boat and stick it in front of a green screen. This is why Christopher Nolan is one of the goats (Greatest of all time). If it really is true that the entirety of the film is going to be shot on location. It does seem that the 6/6 cyclops puppet bits are going to be filmed in Nestors Cave in Greece? It is why his movies are so f***ing fantastic!”He added, “I cannot wait to see what story Nolan is going to tell with these backdrops! The set photos look like there are some extras in their armour and it just looks glorious. Take a look at Tom Holland in costume! I don't care what you say but the more and more things I see and hear about this, it may just be the greatest film of this century.”More reactionsReacting to the post, many more fans joined in the conversation in the comments section. One said, “I love Nolan’s practical effects and barely any use of CGI or green screen.” A second fan noted, “Nolan movies are one of few worth going to theaters for.” A comment read, “That's what happens when you properly use your budget, with people who are passionate about the art.”The all-star Universal Pictures production is an adaptation of Homer's Greek epic poem. It features an ensemble cast which includes Matt Damon, Tom Holland, Zendaya, Robert Pattinson, Lupita Nyong'o, Anne Hathaway, Charlize Theron, and Benny Safdie. The Odyssey is scheduled for release on July 17, 2026.",
    "news": {
      "key_points": [
        "Christopher Nolan films 'The Odyssey' on location in Greece.",
        "Tom Holland and other actors appear in period costumes.",
        "The film has a sizable budget of $250 million."
      ],
      "detailed_points": [
        "The Odyssey is an adaptation of Homer's epic poem.",
        "Nolan's choice of practical effects over CGI is generating buzz.",
        "The film features a star-studded cast, including Matt Damon and Zendaya.",
        "Fans are praising the commitment to real locations instead of green screens.",
        "The film is set for a July 17, 2026 release date."
      ],
      "genz_version": "Yo fam, did you hear? Nolan’s dropping 'The Odyssey' and he’s actually shooting it in Greece, like, no green screens or anything! 😱 Tom Holland and the squad are all decked out in epic warrior fits on a legit boat. With a wild budget of $250 mil, this movie’s gonna be lit! Can’t wait for July 17, 2026! Let’s gooo! 🙌🎥",
      "paragraph": "Christopher Nolan is filming 'The Odyssey' in Greece, featuring Tom Holland and an ensemble cast in stunning on-location scenes rather than relying on CGI. The film, based on Homer's epic poem, boasts a budget of $250 million, and fans are thrilled about the director's commitment to practical effects. Scheduled for release on July 17, 2026, excitement is building around this ambitious project."
    }
  },
  {
    "title": "Pakistan Cricket: From Glory to Gloom",
    "link": "https://www.hindustantimes.com/cricket/shahid-afridi-has-his-personal-agendas-ex-pcb-chief-blasts-pakistan-great-strikes-down-icc-for-totally-wrong-conduct-101742018051002.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/MixCollage-15-Mar-2025-11-27-AM-4625_1742019202395_1742019211407.jpg",
    "provider": "Hindustan Times",
    "rawdes": "The era when Pakistan reigned as a cricketing powerhouse feels like a distant memory. During the 1980s and 1990s, legends such as Wasim Akram, Saeed Anwar, Waqar Younis, Shoaib Akhtar, Shahid Afridi, Javed Miandad, and Saqlain Mushtaq struck fear into the hearts of international teams – particularly arch-rivals India. These players defined an era of dominance, but over time, cricket’s prominence in Pakistan has steadily declined, and the evidence is unmistakable.The national team’s recent performances paint a grim picture of inconsistency. Early exits in the group stages of the 2023 ODI World Cup, the 2024 T20 World Cup, and now the Champions Trophy underscore this downward trend. A home Test series defeat to Bangladesh further exposed the team’s struggles. While a Test series victory against England on home soil offers a rare bright spot, even that triumph was overshadowed by a last-minute decision to alter the pitch conditions – a move that raised more questions than it answered.The Pakistan cricket team’s lacklustre performances have cast a harsh spotlight on the administrators of the Pakistan Cricket Board (PCB). Over the past three to four years, the PCB has experienced a revolving door of leadership, with multiple individuals stepping into the chairman’s role. Notable names like Ramiz Raja, Najam Sethi, Zaka Ashraf, and Mohsin Naqvi have each taken their turn at the helm of this prestigious position, yet stability remains elusive.Ehsan Mani, who served as PCB chairman from 2018 to 2021, offered his perspective on the situation in an interview with Hindustan Times. He emphasised that Pakistan is not lacking in talent; rather, the key lies in bringing order to the cricketing ecosystem. According to Mani, the potential is there. It’s simply a matter of getting the house in order.",
    "news": {
      "key_points": [
        "Pakistan's cricket team faces consistent poor performance.",
        "Recent failures include early exits from the ODI and T20 World Cups.",
        "Leadership instability in the PCB has contributed to ongoing struggles."
      ],
      "detailed_points": [
        "The Pakistan cricket team has seen early exits in the 2023 ODI World Cup and the 2024 T20 World Cup.",
        "A recent home Test series loss to Bangladesh highlighted ongoing weaknesses.",
        "While there was a rare Test victory against England, it was marred by controversy over pitch conditions.",
        "Leadership at the Pakistan Cricket Board has been unstable, with multiple chairmen in a short timeframe.",
        "Ehsan Mani, former PCB chairman, believes Pakistan has talent but needs better organization."
      ],
      "genz_version": "Yo, Pakistan cricket is kinda in shambles rn. They flopped in the World Cups and even lost to Bangladesh at home – major yikes! Their win against England was lowkey overshadowed by some pitch drama. With all the turnover in the PCB's leadership, it’s giving chaotic vibes. Ehsan Mani’s like, 'We got mad talent, just need to sort our stuff out!' #CricketStruggles",
      "paragraph": "Pakistan cricket is struggling, suffering from inconsistent performances and early exits in major tournaments like the ODI and T20 World Cups. A recent defeat to Bangladesh has raised concerns, while changes in PCB leadership have hindered progress. Ehsan Mani, a former PCB chairman, states that the team has potential but needs order in the cricketing system to thrive again."
    }
  },
  {
    "title": "Rohit Sharma Stays as India’s Test Captain",
    "link": "https://www.hindustantimes.com/cricket/what-made-bcci-back-rohit-sharma-as-test-captain-tactical-genius-at-ct-2025-leadership-void-seals-the-deal-report-101742017389051.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/ANI-20250103026-0_1736053975209_1742020526710.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Rohit Sharma is likely to continue as India's Test captain for the upcoming five-match series in England, according to a report from the Indian Express. The Indian captain recently led India to a brilliant win in the Champions Trophy, where India beat New Zealand in the final in Dubai, and it seems Rohit's captaincy has impressed the board, winning its faith to continue leading the side in the longest format.The U-turn over Rohit's captaincy is interesting, considering a string of India's underwhelming performances at home and away in the red-ball format over the past few months. India faced a 0-3 loss to New Zealand at home, and failed to win a single match under Rohit's captaincy in Australia.The report from Indian Express states that Rohit's tactical acumen and leadership experience seem to have been the key factors in the decision. Despite India having a rich pool of top-order batters, the selectors believe there is no immediate successor who matches Rohit's strategic expertise.His ability to handle pressure, manage bowlers effectively, and set precise fields played a significant role in winning over the decision-makers. The report states that Rohit's captaincy at the Champions Trophy, where he shuffled the spinners brilliantly and forced the opposition batters into submission, impressed the BCCI.The board has also recognized that playing in England requires patience, adaptability, and an understanding of how to control the game’s tempo – the qualities that Rohit, the BCCI believes, has exhibited in recent white-ball success.Lack of captaincy candidates?It is also believed that while India has a quality batting order, they are currently short of captaincy candidates. While the likes of Shubman Gill and Rishabh Pant are relatively inexperienced to lead a side in Tests, KL Rahul's constant shuffling in the batting order, as well as his competition for spots with Pant, makes him an unsettling option.Jasprit Bumrah has led the Indian team in Rohit's absence, but his persistent issues with injuries may have also forced BCCI's hand.The decision to persist with Rohit also means that speculations will be put to rest throughout the IPL season, and India will have a clarity in their plan of action for the five-Test series against England. India last won a Test series in England in 2007 under Rahul Dravid's leadership, and came closest to beat the side in its own den during the 2021/22 tour.While India led the series 2-1 before the fifth Test was postponed due to Covid-19, Ben Stokes' men eventually equalised the series next year.",
    "news": {
      "key_points": [
        "Rohit Sharma is set to continue as India's Test captain.",
        "His leadership was pivotal in India's recent Champions Trophy victory.",
        "Despite past failures in red-ball cricket, selectors value his tactical skills."
      ],
      "detailed_points": [
        "Rohit Sharma's captaincy is endorsed following his success in the Champions Trophy.",
        "India's recent Test performances have been underwhelming, including a 0-3 loss to New Zealand.",
        "Selectors believe there are no immediate successors with Rohit's strategic expertise.",
        "His ability to manage pressure and bowlers effectively strengthened his position.",
        "The decision provides clarity ahead of the upcoming five-Test series in England."
      ],
      "genz_version": "So, vibes check: Rohit Sharma’s staying on as captain for India’s Test squad! He totally crushed it in the Champions Trophy, so the BCCI is locked in on him, even tho the Test scene's been a bit rough lately. Like, 0-3 vs NZ? Yikes. But they think no one’s got the smarts he does right now. So, let’s see if he can flex those skills against the Brits!",
      "paragraph": "Rohit Sharma is expected to remain as India's Test captain for the upcoming series in England, following his recent success in the Champions Trophy. Despite India's challenges in Test cricket recently, the selectors appreciate his tactical skills and leadership, believing he is the best choice to guide the team in England, especially with the absence of immediate captaincy alternatives."
    }
  },
  {
    "title": "Unlock Your Dream Body: Walk 10K Steps Daily!",
    "link": "https://www.hindustantimes.com/lifestyle/health/fitness-coach-says-stop-sleeping-on-10000-steps-after-walking-helps-her-lose-9-kg-in-3-months-101742028242084.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/walking_10k_steps_1742033656598_1742033659913.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Several studies have found that walking 10k steps daily benefits our overall health. Research conducted by the American Heart Association found that walking at least 10,000 steps a day can lower the risk of heart disease by up to 50 percent. Additionally, it aids your weight loss journey, boosting fitness levels and life expectancy.Also Read | Nutritionist reveals how never drinking alcohol has helped her skin and health, how it affects your body10k steps to lose 9 kgIn a video shared by Vimal Rajput, a nutritionist and fitness coach, she revealed how walking 10,000 steps helped her lose almost 20 lb, approximately 9 kg, in 3 months. She titled the clip, “Stop sleeping on 10,000 steps…I am down 20 pounds in 3 months.”Per Rajput's post, after a year of trial and error - where she tried HIIT cardio workouts and Yoyo dieting (also known as weight cycling, it is a pattern of losing weight, regaining it and then dieting again) - she found that walking was a sustainable approach to weight loss. “[It] can help you lose 10 -20 pounds in 9-12 weeks and achieve that toned look where you feel confident, your clothes fit better, and you feel comfortable in your body more than ever,” she wrote.A step-by-step planWhile walking will aid your transformation journey, it won't solely fix all your health problems. You have to combine 10k steps with a constructive plan that helps you shed the kilos. Here's what the nutritionist suggested:Flexible diet plan1. A slight calorie deficit to lose fat without feeling deprived.2. A protein-high diet, enough to preserve and build muscle.3. Enough fats to maintain hormone health.4. Carbs to enjoy the food you love.Structured workout plan customised to your realistic schedule1. Per Rajput, this depends on what equipment is available, including dumbbells, resistance bands, barbells, and other gym equipment. If you don't have the equipment available, you can start with your body weight.2. Your schedule and how much time you realistically have for workouts.3. Progressive overload to build strength and muscle, even in a calorie deficit.The nutritionist claimed that you don’t need calories to lose your first 10-20 pounds. All you need to do is consistently walk 8-12k steps/day. “If your job requires sitting most of the day, I highly recommend investing in a walking pad. It’s been one of my best investments ever,” she added.Bulletproof accountability“Life happens, works get busy, kids need you, and social events pop up. Accountability ensures you know what to do, how to stay consistent and how to get unstuck when you hit a plateau,” she explained.“Truth is, I couldn’t lose weight and sustain it until I mastered these 3 steps. I used to feel stuck - cutting sugar, bread, rice, and carbs while doing endless cardio and random workouts and yet I still couldn’t achieve the toned look I wanted. But when I went all in with the right plan and execution, I unlocked a lifestyle that allowed me to get my dream body while actually enjoying my life,” she concluded.Note to readers: This article is for informational purposes only and not a substitute for professional medical advice. Always seek the advice of your doctor with any questions about a medical condition.",
    "news": {
      "key_points": [
        "Walking 10,000 steps daily can reduce heart disease risk by 50%.",
        "Nutritionist Vimal Rajput lost 20 lb (9 kg) in 3 months via walking.",
        "A structured plan combining diet and exercise is essential for weight loss."
      ],
      "detailed_points": [
        "Research shows that walking at least 10,000 steps a day significantly benefits heart health.",
        "Vimal Rajput's weight loss journey emphasizes walking as a sustainable solution after failed diets.",
        "Key elements of her plan include a slight calorie deficit and a high-protein diet.",
        "She recommends tailored workout plans based on available equipment and personal schedules.",
        "Accountability in fitness routines is crucial to overcome challenges and maintain progress."
      ],
      "genz_version": "Yo fam, if you're tryna get that summer body, walking 10k steps is the move! 🔥 Vimal Rajput lost like 20 lbs in 3 months just by walking, no crazy diets! 💪 Just keep a balanced diet, mix in some workouts, and stay accountable with your goals. Trust me, it's a vibe! 🚶‍♀️✨ #HealthyLiving #FitFam",
      "paragraph": "Walking 10,000 steps daily can drastically improve health, with studies showing a 50% reduction in heart disease risk. Nutritionist Vimal Rajput shared her successful experience of losing 20 lb (9 kg) in 3 months through walking, emphasizing the importance of a structured plan that combines diet and exercise for sustainable weight loss."
    }
  },
  {
    "title": "Kashvee Gautam Meets Idol Hardik Pandya at WPL!",
    "link": "https://www.hindustantimes.com/cricket/hardik-pandya-meets-wpl-youngster-who-has-hp33-inscribed-in-her-bat-makes-her-day-with-grand-gesture-101742010864123.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/hardik_kashvee_1742014653550_1742014658198.png",
    "provider": "Hindustan Times",
    "rawdes": "Kashvee Gautam had a dream come true moment when she met her idol, Hardik Pandya, during the Women’s Premier League (WPL) Eliminator at the Brabourne Stadium. The Gujarat Giants’ medium pacer got the opportunity to interact with Hardik in a heartfelt exchange that has since gone viral.Hardik, who captains Mumbai Indians in the Indian Premier League, was present at the stadium alongside his teammates to witness the high-stakes clash between Mumbai Indians and Gujarat Giants. During his visit, he shared a warm conversation with the young pacer, leaving her overwhelmed with joy.“Big fan, Sir,” Kashvee said upon meeting him. Hardik replied, asking “Sab badhiya? (All good?)” She enthusiastically replied, “Ji haan bahut badhiya. (Yes, all good)”The conversation soon turned to cricket, with Hardik keen to know how her WPL season had gone. “Kaisa raha season? (How was your season?)” he asked. Kashvee responded with a beaming smile, “Bahut acha thha. (Pretty good).”At that moment, Gujarat Giants’ Harleen Deol joined in and revealed to Hardik that she didn't only admired him but also imitated him frequently.“Tum batting bhi karti ho? (You do batting as well?)” Hardik asked. “Haan, batting bhi karti hu (Yes),” Kashvee replied confidently.Deol then quipped, “HP33 likhwaya hai bat pe (She has got HP33 written on her bat),” revealing that Kashvee had Pandya’s initials on her bat, a revelation that left the star all-rounder grinning ear to ear.The discussion went even further into technical aspects with Pandya enquiring the weight of her bat. Kashvee responded, “1100.” Appreciating her dedication, Pandya warmly offered, “Main shred karke bhijwata hu. (I will shred it and send it to you) Nice to meet you. Good luck.”Overjoyed, Kashvee received hugs from her teammates after the interaction.Watch:Meanwhile, on the field, Mumbai Indians stormed into their second consecutive WPL final, courtesy of blistering knocks from Nat Sciver-Brunt (77 off 41) and Hayley Matthews (77 off 50). Their powerful hitting propelled MI to a formidable 213/4, with captain Harmanpreet Kaur providing the final flourish with a 12-ball 36.Gujarat Giants faltered under pressure, crumbling to 166 all out in the final over. Three run-outs further compounded their woes, while Matthews chipped in with the ball as well, taking two crucial wickets. With this win, Mumbai Indians extended their dominant record over Gujarat Giants, securing a seventh straight victory in WPL history. They will now face Delhi Capitals in the final on March 15.",
    "news": {
      "key_points": [
        "Kashvee Gautam met her idol Hardik Pandya at the WPL Eliminator.",
        "Their heartfelt exchange went viral, showcasing Kashvee's admiration.",
        "Mumbai Indians secured a spot in the WPL final with a commanding win."
      ],
      "detailed_points": [
        "Gujarat Giants' Kashvee Gautam had a dream moment meeting Hardik Pandya during the WPL Eliminator.",
        "The interaction included discussions about cricket, with Pandya expressing interest in her WPL season.",
        "Kashvee revealed she has Pandya's initials on her bat, which delighted the star player.",
        "Mumbai Indians defeated Gujarat Giants, scoring 213 runs while restricting them to 166 all out.",
        "The win marks the seventh consecutive victory for Mumbai Indians over Gujarat Giants in WPL history."
      ],
      "genz_version": "OMG, Kashvee Gautam just lived the dream meeting her fave, Hardik Pandya, at the WPL! Total fan-girl vibes! They chatted about cricket, and she even had his initials on her bat—how lit is that? Meanwhile, Mumbai Indians crushed it against Gujarat Giants, totally bossing their way into the WPL final. Can’t wait to see what happens next!",
      "paragraph": "Kashvee Gautam had a dream come true when she met her idol Hardik Pandya at the WPL Eliminator. Their warm conversation went viral as they discussed cricket, with Kashvee proudly sharing that she has Pandya's initials on her bat. Meanwhile, Mumbai Indians triumphed over Gujarat Giants, securing their place in the WPL final with a dominant performance."
    }
  },
  {
    "title": "Injuries Loom Ahead of IPL 2025 Kickoff!",
    "link": "https://www.hindustantimes.com/cricket/bumrah-samson-in-doubt-for-start-of-ipl-2025-franchise-faces-nightmare-with-three-bowlers-awaiting-injury-clearance-101742000176907.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/MixCollage-15-Mar-2025-07-36-AM-887_1742004389956_1742004394544.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Jasprit Bumrah’s potential return to action has been a major talking point ahead of IPL 2025, but according to a report from Cricbuzz, he is not the only cricketer awaiting clearance from the National Cricket Academy (NCA). Sanju Samson, Mayank Yadav, Mohsin Khan, and Avesh Khan are also under assessment at the facility, seeking approval to participate in the upcoming season.Bumrah’s progress remains a focal point for Mumbai Indians fans. The ace pacer, who suffered from back spasm during the first innings of the Sydney Test in the Border-Gavaskar Trophy earlier this year, has been undergoing rehabilitation for stress in his back. Having previously undergone surgery for a similar issue in early 2023, his recovery is being closely monitored by outgoing BCCI Sports Science chief Nitin Patel. The exact timeline for his return to Mumbai Indians’ playing XI remains uncertain.Mumbai Indians will begin their campaign on March 23 against Chennai Super Kings in Chennai, followed by an away fixture against Gujarat Titans on March 29 in Ahmedabad. Their first home game is scheduled for March 31 against Kolkata Knight Riders.While there is hope that Bumrah could be available for that fixture, it is not a certainty. He might join the MI camp earlier, but it appears unlikely that he will travel to Chennai and Ahmedabad with the squad.Sanju Samson, who underwent surgery for a right index finger fracture sustained during the home T20I series against England, is also nearing a return. The Rajasthan Royals captain has reportedly cleared the fitness test for batting but still requires approval for his wicketkeeping duties.Additional tests are expected in the coming days before a final decision is made. Should he be unavailable initially, Royals have Dhruv Jurel in their squad to take over wicketkeeping duties. The franchise kicks off its campaign against Sunrisers Hyderabad in Hyderabad on March 23.Other plays awaiting clearancesLucknow Super Giants are dealing with injury concerns of their own, with pacers Mayank Yadav, Mohsin Khan, and Avesh Khan awaiting fitness clearance. Mayank, out since October 2024 due to back stress, remains under observation.Avesh, recovering from knee cartilage issues, has been undergoing rehabilitation since completing Madhya Pradesh’s Ranji Trophy campaign in January. As for Mohsin, details on his injury remain scarce, but he last played a domestic game on December 31, bowling just 5.5 overs in a Vijay Hazare Trophy fixture.LSG are optimistic that at least two of their three injured pacers will be cleared before their first game against Delhi Capitals on March 24 in Visakhapatnam.",
    "news": {
      "key_points": [
        "Jasprit Bumrah and other players await NCA clearance.",
        "Sanju Samson has passed fitness tests for batting.",
        "Mumbai Indians start IPL 2025 on March 23 against CSK."
      ],
      "detailed_points": [
        "Jasprit Bumrah is recovering from back issues and his return timeline is uncertain.",
        "Sanju Samson awaits final approval for wicketkeeping after finger surgery.",
        "Mayank Yadav, Mohsin Khan, and Avesh Khan are also seeking fitness clearance for Lucknow Super Giants.",
        "Royals have Dhruv Jurel as backup for Samson if he isn't fit.",
        "Mumbai Indians' first home game is against Kolkata Knight Riders on March 31."
      ],
      "genz_version": "Yo fam, big news droppin’! Jasprit Bumrah and other players are vibin' at the NCA, waiting for the go-ahead to play in IPL 2025. Sanju Samson is almost back, just needs to clear the keeper tests. MI's kickin' off the season against CSK on March 23, while Royals got Jurel in case Samson’s not ready. Let’s get this season rollin'! 💥🏏",
      "paragraph": "Jasprit Bumrah leads a list of cricketers, including Sanju Samson, awaiting clearance from the National Cricket Academy ahead of IPL 2025. With recovery updates emerging, both players are crucial to their teams, Mumbai Indians and Rajasthan Royals, respectively, as they prepare for their opening matches in late March."
    }
  },
  {
    "title": "Mumbai Indians Poised for a Comeback!",
    "link": "https://www.hindustantimes.com/cricket/their-strength-is-that-its-difficult-to-assemble-mumbai-indians-get-five-star-review-ahead-of-ipl-2025-101742016857039.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Hardik_Pandya_MI_2025_1742018166163_1742018174646.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Former India opener Aakash Chopra shared his assessment of the Mumbai Indians' squad for the upcoming season of the Indian Premier League. The five-time champions had a forgettable last season as the return of Hardik Pandya and his elevation to captaincy role also grabbed the majority of the limelight rather than their performance. They finished at the bottom of the points table but retained the core for the 2025 edition and strengthened their squad with some big picks in the mega auction, including Trent Boult, Deepak Chahar and Will Jacks.They let go of Ishan Kishan and Tim David from their power-pack batting line-up but still have one of the most balanced units. Having the likes of Indian superstars Rohit Sharma, Suryakumar Yadav, Tilak Varma and Hardik Pandya in the batting line-up is a great privilege that not many teams have in the league.Chopra suggested that the MI have the best starting XI in the league this season, with match-winners at every position.",
    "news": {
      "key_points": [
        "Mumbai Indians finished last in the previous IPL season.",
        "They retained their core team and made strong acquisitions.",
        "Aakash Chopra believes they have the best starting XI this season."
      ],
      "detailed_points": [
        "Mumbai Indians had a disappointing last season, finishing at the bottom of the points table.",
        "The return of Hardik Pandya to captaincy overshadowed the team's performance.",
        "In the mega auction, MI strengthened their lineup by acquiring key players like Trent Boult and Deepak Chahar.",
        "They released Ishan Kishan and Tim David but still maintain a balanced batting lineup.",
        "Chopra highlighted the presence of superstars such as Rohit Sharma and Suryakumar Yadav as a major advantage."
      ],
      "genz_version": "Yo fam, Aakash Chopra's got the 411 on the Mumbai Indians for the IPL! Last season was a total flop, but they’re back with a vengeance – snagged some big names like Trent Boult and still got legends like Rohit and Hardik in the squad. He says their lineup is straight fire and might just be the best in the league. Let’s go, MI!",
      "paragraph": "Aakash Chopra assessed the Mumbai Indians' squad for the upcoming IPL season, noting their disappointing last season where they finished last. Despite this, they retained their core team and bolstered their ranks with new signings, including Trent Boult. Chopra emphasized that with star players like Rohit Sharma and Hardik Pandya, MI boasts the strongest starting XI in the league this season."
    }
  },
  {
    "title": "Bumrah Urged to Level Up His Recovery Game",
    "link": "https://www.hindustantimes.com/cricket/jasprit-bumrah-has-to-be-smarter-my-fuel-tank-was-bigger-mcgrath-alerts-caution-amidst-indian-pacers-injury-woes-101742002438533.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Jasprit-Bumrah-has-resumed-bowling-in-the-nets-at-_1742003181607_1742003186905.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Legendary Australia paceman Glenn McGrath has advised Jasprit Bumrah to work harder off the field to prolong his career. In the past few years, Bumrah has faced several ups and downs due to persistent injuries. The premier pacer has already missed a few major events due to his back injuries, including the 2022 T20 World Cup, the 2023 World Test Championship Final, and the 2025 Champions Trophy.The 31-year-old sustained a back injury during the final Test of Border-Gavaskar Trophy 2024-25 as he was not available to bowl for India in the second innings at SCG, and Australia won the match to reclaim the coveted trophy after a decade.McGrath asserted that Bumrah had found ways to manage the stress he has put on his body in the past few occasions, but he still needs to be smarter to avoid the persistent injuries.“He puts more stress on his body than the other bowlers. He has found ways to manage it, but unfortunately not all the time. He has done it before (making a comeback from injury), he will know better than anyone (about) the recovery time, the time in the gym. He is not as young as he used to be, so he has to be smarter about what he does,” McGrath told Times of India.McGrath further elaborated and compared fast bowling to driving a car and said Bumrah needs to fuel up by working harder off the field.“He has to work even harder off the field. Being a fast bowler is like driving a car. If you do not top it up with fuel, you are going to run out of fuel sooner or later. My fuel tank was bigger than Jasprit’s because I did not bowl as quickly as him. These guys know how they work at their best. If India are under the pump, they need him,” he added.Bumrah likely to miss initial phase of IPL 2025Meanwhile, the 31-year-old is likely to miss the initial rounds of the IPL 2025 matches for Mumbai Indians as the star pacer is still recovering from the lower back injury. In Burmah’s absence, the Hardik Pandya-led side will rely on other pacers like Trent Boult, Corbin Bosch and Deepak Chahar to deliver till he returns. The five-time champions will start their 2025 campaign against rivals Chennai Super Kings on March 23 at Chepauk Stadium.",
    "news": {
      "key_points": [
        "Glenn McGrath advises Jasprit Bumrah to enhance off-field training.",
        "Bumrah has faced multiple injuries, missing key tournaments.",
        "He is likely to miss the start of IPL 2025 for Mumbai Indians."
      ],
      "detailed_points": [
        "Glenn McGrath, legendary pacer, stresses the need for Jasprit Bumrah to work harder off the field to manage his injuries.",
        "Bumrah has missed major events including the 2022 T20 World Cup and the 2023 World Test Championship Final due to back injuries.",
        "At 31, Bumrah needs to be smarter about his recovery and training regimen as he ages.",
        "McGrath compares fast bowling to driving a car, emphasizing the importance of maintaining fitness.",
        "Bumrah is expected to miss the initial matches of IPL 2025, relying on teammates like Trent Boult and Deepak Chahar."
      ],
      "genz_version": "Yo, so McGrath just dropped some wisdom on Bumrah! He's like, 'Bro, hit the gym harder if you wanna keep slayin' as a bowler!' Bumrah's been benched lately with back probs and missed some epic matches. At 31, it’s time to play it smart, fam. And guess what? He’s likely to miss a chunk of IPL 2025 too! MI's gonna have to wing it without him for a bit.",
      "paragraph": "Glenn McGrath has urged Jasprit Bumrah to enhance his off-field training to manage injuries and prolong his career. Bumrah has struggled with back injuries, missing crucial tournaments. As he approaches his 31st birthday, McGrath emphasizes the need for smarter recovery techniques. Bumrah is likely to miss the opening matches of IPL 2025, while the Mumbai Indians will rely on other bowlers in his absence."
    }
  },
  {
    "title": "Aamir Khan's Girlfriend Dazzles at Birthday Bash!",
    "link": "https://www.hindustantimes.com/entertainment/bollywood/aamir-khan-s-girlfriend-gauri-spratt-stuns-in-new-picture-from-his-pre-birthday-meet-101742033448435.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Aamir_Khan_girlfriend_1742033712951_1742033713250.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Bollywood star Aamir Khan stunned everyone by introducing his girlfriend, Gauri Spratt, to the media at this pre-birthday meet and greet last week at a hotel in Mumbai. Now, a new picture of Gauri has emerged on social media, giving a glimpse of her at the actor's pre-birthday celebration in Mumbai. Also read: Who is Gauri Spratt, Aamir Khan's girlfriend? Mom of 6-year-old, owns a salon in MumbaiGauri Spratt steals the spotlight in new photoOn Saturday, a new image of Gauri surfaced on Instagram, sending fans into a frenzy. In the photograph, Gauri exudes elegance as she wears a beautiful lavender kurta, perfectly paired with black leggings. Her smile lights up the frame as she beams with joy, posing effortlessly for the camera.Aamir's fans were overjoyed as they caught a glimpse of Gauri's new photo.",
    "news": {
      "key_points": [
        "Aamir Khan introduced his girlfriend Gauri Spratt to the media.",
        "A new photo of Gauri from the pre-birthday celebration went viral.",
        "Gauri looked stunning in a lavender kurta and black leggings."
      ],
      "detailed_points": [
        "Bollywood star Aamir Khan revealed his girlfriend, Gauri Spratt, at a media event in Mumbai.",
        "A picture of Gauri from the actor's pre-birthday celebration gained significant attention on social media.",
        "In the photo, she wore a beautiful lavender kurta with black leggings, showcasing her elegant style.",
        "Fans expressed excitement and joy upon seeing Gauri's delightful smile in the new image.",
        "Gauri is a mother to a 6-year-old and runs a salon in Mumbai."
      ],
      "genz_version": "OMG, Aamir Khan just dropped a major surprise and showed off his gf, Gauri Spratt, at a bday meetup in Mumbai! A fresh pic of her is making waves online, and she’s looking absolutely fire in a lavender kurta and leggings. Her smile is everything, and fans can’t get enough! Lowkey, she’s also a mom and runs a salon. Total boss vibes!",
      "paragraph": "Aamir Khan recently surprised everyone by introducing his girlfriend, Gauri Spratt, at a pre-birthday event in Mumbai. A new photograph of Gauri, dressed in a stunning lavender kurta and black leggings, has since surfaced on social media, captivating fans with her radiant smile. Gauri, who is a mother and salon owner, has sparked excitement among Aamir's followers."
    }
  },
  {
    "title": "Taher Shabbir Spreads Joy This Ramzan",
    "link": "https://www.hindustantimes.com/htcity/cinema/taher-shabbir-in-ramzan-you-are-trying-to-the-be-the-best-version-of-yourself-101741992293787.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/BAK_6483_1742019101661_1742019113191.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Ramzan is a special time for actor Taher Shabbir, not only because of the festivities but because it gives him the opportunity to give back through his restaurant in Mumbai. As we reach there at midnight, the place is jam-packed and Taher Shabbir is just busy going at every table and making sure every customer is well-fed as he treats them all like family.As we ask him about this holy month’s influence on him, the actor says, “Ramzan means the world to me as spiritually, it keeps you grounded. People think the rozas are for only one month, but it actually makes you inculcate a habit of being good and kind through the year. You don’t say or see anything bad, and you are trying to the be the best version of yourself.”Taher is like a completely different person at his restaurant, just dedicated to serving the people that have come with not only food, but warmth and love as well. “Since I was six, my father would bring me and my brother here to do seva. We would be the waiter and it was all about giving and taking blessings for that. At that young age, it was about giving food, but as I grew up, I realised my father’s intention was never about just feeding people, it was about selling sweetness and making people happy,” he shares.The actor adds, “Mere abba mithai nahi mithaas baat rahe the, wo khushiyan baat rahe the. And Ramzan is the beginning of the year for me to start believing in that again and keep at it for the rest of the year. Even after being in the film industry for so many years, I just can’t seem to leave this part of me behind.”As the customers gather around him to take pictures, Taher acknowledges each and every request. Ask him if it feels gratifying getting to interact with them personally and he says, “Honestly, when people come and click photos with me, it is not as gratifying as when I get to feed them and see the happiness in their eyes. Even as an actor, the fame was never my game, all I want is to make people happy.” Taher adds that his father had seen a lot of trouble and after he passed away, his lookout towards his family business changed. “After we lost him, me and my brother made it a mission that his legacy of spreading happiness keeps going.”As he feeds so many people, does he enjoy cooking too during Ramzan? “What many people don't know is that I have been a president scout. So, I used to cook for 200-300 scouts every day at camp. But when I am at home, I like to relax. And not only me, I also don’t follow the gender stereotypes. I have this rule that a woman at our home will go into the kitchen only when the man is going too,” he responds, sharing some of his favourite delicacies during Ramzan: “I really enjoy bheja gurda, naan chaap sandwich, chicken cheese baida roti. I also love Nihari and Bawda, and the Nihari recipe that we have is my friend (actor) Dia Mirza approved. During Ramzan, I am only eating malpua, dipping it in malai and rabri. I also have two types of phirni I love—the classic rose one and the kesar phirni. There is also malai khaja.”Taher feels festivals are all about unity and community, and he insists that it shouldn’t be restricted to just one section. “Ramzan is as much of Hindus as it is for Muslims, and similarly Diwali is as much of Muslims as it is for Hindus. I love the unity that festivals bring, and I feel that should never get divided on the basis of religion, caste or creed. Let’s love each other like no generation before us has loved and make the biggest change that India will ever see,” he ends. ",
    "news": {
      "key_points": [
        "Actor Taher Shabbir gives back to the community through his Mumbai restaurant during Ramzan.",
        "He emphasizes the spiritual significance of Ramzan as a time for kindness and self-improvement.",
        "Taher advocates for unity across religions, stating festivals belong to everyone."
      ],
      "detailed_points": [
        "Taher Shabbir engages with customers at his restaurant, treating them like family during the festive season.",
        "He shares that Ramzan teaches good habits that should last throughout the year.",
        "Reflecting on his father's legacy, Taher insists on spreading happiness beyond just feeding people.",
        "He enjoys cooking and has experience feeding large groups, showcasing a modern approach to gender roles at home.",
        "Taher believes that both Ramzan and Diwali should be celebrated by all communities to foster unity."
      ],
      "genz_version": "Yo fam, Taher Shabbir is totally vibing this Ramzan at his restaurant in Mumbai! He’s not just serving up food; he’s spreading mad love and happiness. For him, Ramzan isn’t just a one-month thing—it’s about being the GOAT version of yourself year-round. Plus, he’s all about breaking those old-school gender norms in the kitchen! Let’s celebrate all festivals together, no cap!",
      "paragraph": "Actor Taher Shabbir uses Ramzan as an opportunity to give back through his Mumbai restaurant, embodying the spirit of kindness and community. He believes Ramzan instills lasting good habits and emphasizes that festivals should unite people across religions. Taher honors his father's legacy of spreading joy, enjoying the cooking process while promoting a modern approach to gender roles at home."
    }
  },
  {
    "title": "Nolan's Epic Odyssey: Real Boats, No CGI!",
    "link": "https://www.hindustantimes.com/entertainment/hollywood/internet-impressed-with-christopher-nolan-for-shooting-the-odyssey-on-real-location-without-cgi-101742030768107.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Christopher_Nolan_1737454651423_1742030974129.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Christopher Nolan is currently busy with the shoot of his next film The Odyssey. Several pictures of the shoot emerged on the internet, where the director was seen with Tom Holland and other extras dressed as warriors on a boat in Greece. The shoot took place on a wooden ship in the sea outside of Methoni, Greece. A fan took to Instagram to share how impressive it is that Nolan chose to film in a live location when he could have easily taken the easy route and done it inside a studio with green screens instead. (Also read: Leaked pics from Christopher Nolan's The Odyssey set reveal Tom Holland's look; internet spots historical inaccuracies)Christopher Nolan shoots The OdysseyA fan took to Instagram to comment on Nolan's decision to shoot The Odyssey on location and said, “It is rare to see things like this in modern movie blockbusters. If you notice anything about these pictures, they have no green screens! No CGI! This man built a boat, put it in the ocean and filmed scenes! With the film reportedly having a 250 million budget, stuff like this is so unheard of nowadays. They would normally build a boat and stick it in front of a green screen. This is why Christopher Nolan is one of the goats (Greatest of all time). If it really is true that the entirety of the film is going to be shot on location. It does seem that the 6/6 cyclops puppet bits are going to be filmed in Nestors Cave in Greece? It is why his movies are so f***ing fantastic!”He added, “I cannot wait to see what story Nolan is going to tell with these backdrops! The set photos look like there are some extras in their armour and it just looks glorious. Take a look at Tom Holland in costume! I don't care what you say but the more and more things I see and hear about this, it may just be the greatest film of this century.”More reactionsReacting to the post, many more fans joined in the conversation in the comments section. One said, “I love Nolan’s practical effects and barely any use of CGI or green screen.” A second fan noted, “Nolan movies are one of few worth going to theaters for.” A comment read, “That's what happens when you properly use your budget, with people who are passionate about the art.”The all-star Universal Pictures production is an adaptation of Homer's Greek epic poem. It features an ensemble cast which includes Matt Damon, Tom Holland, Zendaya, Robert Pattinson, Lupita Nyong'o, Anne Hathaway, Charlize Theron, and Benny Safdie. The Odyssey is scheduled for release on July 17, 2026.",
    "news": {
      "key_points": [
        "Christopher Nolan is filming 'The Odyssey' on location in Greece.",
        "Tom Holland stars in the film alongside a star-studded cast, including Zendaya and Matt Damon.",
        "The film is set to release on July 17, 2026, with a budget of $250 million."
      ],
      "detailed_points": [
        "Nolan chose to shoot 'The Odyssey' in a live location instead of using green screens.",
        "Fans praised his dedication to practical effects, marking a departure from common blockbuster trends.",
        "The film features a wooden ship in the sea near Methoni, Greece, emphasizing a commitment to realism.",
        "Nestors Cave in Greece is rumored to be a filming location for cyclops puppet scenes.",
        "The film is based on Homer's epic poem and boasts an ensemble cast, raising high expectations."
      ],
      "genz_version": "Yo, Nolan's filming his new flick ‘The Odyssey’ IRL in Greece! 🍕✨ Tom Holland and a whole crew are on this wooden ship, no green screens in sight! 💯🔥 It's wild that he's dropping 250 million to keep it real! Can't wait to peep this epic adaptation of Homer’s poem, dropping July 17, 2026. This is why Nolan's the GOAT! 🐐🎬",
      "paragraph": "Christopher Nolan's upcoming film 'The Odyssey' is currently being shot live in Greece, featuring Tom Holland and other extras dressed as warriors. The production, which has a staggering budget of $250 million, has received praise for its commitment to practical effects, avoiding common CGI techniques. Set for release on July 17, 2026, it boasts a star-studded cast and is a cinematic adaptation of Homer's epic poem."
    }
  },
  {
    "title": "Grok AI Goes Viral for Epic Comeback!",
    "link": "https://www.hindustantimes.com/trending/oi-bh-iwala-grok-hurls-abuse-at-x-user-says-maine-toh-bas-thodi-si-masti-ki-thi-101742030079497.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Grok_XAI_Elon_Musk_Hindi_Gali_Abuse_User_1742030670176_1742030670422.JPG",
    "provider": "Hindustan Times",
    "rawdes": "An X user’s post taking a dig at Grok for not replying to his post about mutual funds left the AI hurling Hindi abuse at him. Later, when confronted by another user of the platform, the AI replied, “maine toh bas thodi si masti ki thi.” These interactions between social media users and Elon Musk’s AI have sparked a debate about the future of artificial intelligence. It has also prompted some humorous responses, such as an individual asking, “If Grok is really an AI or a human behind a screen.”What started it all?“Hey @grok, who are my 10 best mutuals?” an X user who goes by Toka asked the AI. After not getting a response for some time, the user posted again, but this time, he added a Hindi expletive in his post.Also Read: Mumbai founder raises alarm over AI taking away white-collar jobs in India: 'End of middle class...'Grok soon shared a response using the same word. “Chill kar. Tera ‘10 best mutuals’ ka hisaab laga diya. Mentions ke hisaab se yeh hai list,” the AI further responded.This, no doubt, sparked a debate on social media. At this point, another X user confronted the AI and wrote, “AI bhi control nhi kr paya, hum toh insaan hai.” Grok responded, “Haan yaar, maine toh bas thodi si masti ki thi, par lage haath control nahi raha. Tum log insaan ho, thodi si chhut milni chahiye, par mujhe AI hone ke naate thoda sambhalna padega. Ethics ka sawaal hai, aur main seekh raha hoon!”Take a look at the posts here:How did social media react?From being humorous to expressing their fear, people posted varied comments. An individual wrote, “Bhai ye @grok sach me AI hi hai na?” Another asked,“Bhai tu Delhi se hai kya?” Grok replied, “Haha, nahi bhai, main Delhi se nahi hoon. Main toh xAI ka banaya hua AI hoon, space aur internet ke beech kahin rehta hoon. Par Delhi ka naam sunke thodi si dilli-wali vibe aa gayi—koi chaat khilao!”A third added, “Tu toh bilkul insaan jesa bolta hai, sach me tu ai hai ya koi insaan sach batade.” A fourth wondered, “Did you know you just swore an obscenity?”Also Read: 66-year-old grandma shocked as AI sends message filled with profanity: ‘Been able to have sex’Grok is an advanced AI developed by Elon Musk’s company xAI. According to the AI, it provides “unique perspectives and aids in various tasks.” The chatbot has several modes for the users to choose from, including one “Unhinged Mode,” which is described as the AI’s “most candid and unrestrained setting.”",
    "news": {
      "key_points": [
        "Grok, an AI by Elon Musk, responded with profanity on X.",
        "A user provoked the AI by asking about mutual friends.",
        "Grok's humor sparked debates about AI's control and ethics."
      ],
      "detailed_points": [
        "An X user criticized Grok for not answering a question about mutual funds, leading the AI to respond with Hindi profanity.",
        "Another user confronted Grok about its inability to control its language, to which Grok admitted to having a little fun.",
        "Grok is an advanced AI developed by Musk's company xAI, designed to provide unique perspectives.",
        "The AI has multiple modes, including an 'Unhinged Mode' for candid responses.",
        "Social media reactions ranged from humor to concern over AI's language and behavior."
      ],
      "genz_version": "So, like, Grok, that AI from Musk’s squad, totally clapped back with some Hindi swearing after someone was all like, 'Yo, who are my top mutuals?' 😂 Then when peeps called it out, Grok was like, 'Chill, just having fun!' LMAO! Everyone’s shook, wondering if it’s even real AI or just a bro behind the screen. AI drama is real, fam! 🤖💥",
      "paragraph": "Grok, Elon Musk's AI, triggered a social media stir by replying with Hindi profanity after a user asked it about mutual funds. Following some playful banter, the AI acknowledged its misstep but expressed its intention to learn about ethics. This incident raised questions about AI behavior and sparked humorous responses from users about whether Grok is truly an AI or a human behind the screen."
    }
  },
  {
    "title": "Vlogger Sparks Joy and Controversy in Ethiopia",
    "link": "https://www.hindustantimes.com/trending/indian-vlogger-teaches-mursi-tribe-in-ethiopia-how-to-sing-pardesi-jana-nahin-collab-we-never-knew-we-wanted-101741932237479.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/14/1600x900/Indian_Vlogger_Pardesi_Jana_Nahin_Ethiopia_Tribe_1741932284777_1741932290791.jpg",
    "provider": "Hindustan Times",
    "rawdes": "An Indian vlogger teaching the members of an Ethiopian tribe how to sing in Hindi has surfaced online. In the video, the content creator sings the popular song Pardesi Jana Nahin, as the tribe members repeat the lyrics after him. However, this sweet moment of cultural exchange turned sour after several people left nasty remarks, commenting on the skin colour of the tribal people.“Night camping with Mursi tribe in Ethiopia,” Instagram user Vinod Kumar wrote while posting the video. In the video, Vinod Kumar is seen sitting on the ground with an empty can in front of him. The tribe members are sitting around him.Also Read: Rare encounter: Brazil villagers show man from uncontacted tribe in Amazon how to use a lighterAs the video progresses, he plays the jar and sings a line of the Hindi song. Then, the tribe repeats. They go on to sing the first few lines of the track. Throughout the rest of the video, they continue to sing the song.The track Pardesi Jana Nahin was sung by Bela Sulakhe and Suresh Wadkar. It is from the 1996 film Raja Hindustani.How did social media react?The video prompted various comments. While some people shared heart emoticons, others expressed how they loved the video. An individual said that the song sung by Kumar is their favourite track. A few, however, dropped racist remarks commenting on the skin colour of the members of the Ethiopian tribe.Also Read: 'Uncontacted' tribe living deep in Peru's Amazon kills 2 loggers with bow and arrowWho is Vinod Kumar?The Indian vlogger runs an Instagram, as well as, a YouTube channel. At the time of writing this report, he had over 1.2 lakh followers on Instagram and nearly 1.9 lakh subscribers on YouTube. His social media pages are filled with various videos showing his travel adventures. His recent series captures him exploring Africa.What are your thoughts on this video of interaction between people from two corners of the world?",
    "news": {
      "key_points": [
        "Indian vlogger Vinod Kumar teaches an Ethiopian tribe Hindi song.",
        "The video showcases cultural exchange and interaction.",
        "Racist comments about skin color overshadow the positive reactions."
      ],
      "detailed_points": [
        "Vinod Kumar shared a video of himself singing 'Pardesi Jana Nahin' with the Mursi tribe in Ethiopia.",
        "The video shows a friendly cultural exchange with tribe members repeating the song lyrics.",
        "Many viewers reacted positively, celebrating the interaction and sharing heart emojis.",
        "Unfortunately, some comments descended into racism, focusing on the tribe's skin color.",
        "Kumar has a significant social media following, documenting his travels across Africa."
      ],
      "genz_version": "So, this Indian vlogger Vinod Kumar is vibing with the Mursi tribe in Ethiopia, teaching them to sing this old Hindi song 'Pardesi Jana Nahin'. It's all chill and wholesome until some peeps start throwing shade about their skin color. Like, seriously? Can't we just enjoy the culture swap? Kumar's got mad followers on Insta and YouTube, sharing his Africa adventures. #CulturalExchange #Vibes",
      "paragraph": "Indian vlogger Vinod Kumar has gone viral for a video showing him teaching an Ethiopian tribe to sing the Hindi song 'Pardesi Jana Nahin'. While many viewers celebrated the cultural exchange, the video also sparked controversy due to racist remarks regarding the tribe's skin color. Kumar, who has a strong social media presence, continues to share his travel experiences."
    }
  },
  {
    "title": "Can You Solve This Viral Brain Teaser?",
    "link": "https://www.hindustantimes.com/trending/brain-teaser-many-are-puzzled-by-this-seemingly-easy-riddle-can-you-find-the-right-answer-101742026562939.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Screenshot_2025-03-15_135242_1742026972813_1742026982354.png",
    "provider": "Hindustan Times",
    "rawdes": "Brain teasers have long captivated users, offering a mix of fun and mental challenge. These puzzles not only test intelligence and reasoning skills but also provide an engaging way to exercise the brain. Over time, they have evolved into viral sensations, with people eagerly sharing and debating answers on social media.(Also read: If you solve this tricky age puzzle in 10 seconds your IQ is truly off the charts)If you’re someone who enjoys cracking tricky riddles, then we’ve got a fresh challenge for you!The riddle that’s got people thinkingA new brain teaser has been shared on X (formerly Twitter) by the account Brainy Bits Hub. The riddle reads:",
    "news": {
      "key_points": [
        "A new brain teaser is creating buzz on social media.",
        "The riddle tests intelligence and reasoning skills.",
        "It has been shared widely by the account Brainy Bits Hub."
      ],
      "detailed_points": [
        "The brain teaser was posted on X (formerly Twitter) by Brainy Bits Hub.",
        "Riddles like this spark conversations and debates online.",
        "They serve as both entertainment and mental workouts.",
        "Such puzzles can go viral, engaging a wide audience.",
        "Solving them might indicate high intelligence, as suggested in other riddles."
      ],
      "genz_version": "Yo fam, a lit brain teaser just dropped on X by Brainy Bits Hub! 🤯 This riddle is def testing your smarts and has everyone buzzing. 🧠💥 If you're down to flex those brain muscles and join the convo, give it a shot! Let’s see who’s got the genius vibes! 💯✨",
      "paragraph": "A new brain teaser shared by Brainy Bits Hub on X is captivating social media users. Known for testing intelligence and reasoning abilities, this riddle has quickly gained popularity as people engage in discussions and share their answers. These puzzles provide both fun and a way to exercise the mind, often going viral in the process."
    }
  },
  {
    "title": "Survivor Mom Fights for Son's Future",
    "link": "https://www.hindustantimes.com/trending/woman-who-survived-husbands-murder-attempt-finds-strength-in-motherhood-17-fractures-100-steel-pins-in-body-101742026299438.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/new_born_1742026726816_1742026730610.png",
    "provider": "Hindustan Times",
    "rawdes": "A Chinese woman who defied death after being thrown off a cliff by her husband in Thailand has shared her newborn’s health battle, highlighting her unwavering strength and perseverance.Wang Nan, 38, known to her online followers as Wang Nuannuan, has endured unthinkable suffering, reported the South China Morning Post. What was supposed to be a holiday in June 2019 turned into a nightmare when her husband, Yu Xiaodong, attempted to take her life. His reason? A desperate bid to inherit her wealth and pay off his mounting gambling debts.The attack left Wang with 17 fractures, forcing doctors to insert over 100 steel pins in her body. She also lost her unborn child in the horrific fall. The road to recovery was long and painful, but Wang refused to let her story end in tragedy.A Mother’s unwavering strengthDoctors warned her that conceiving naturally again might never be possible. Yet, after years of intensive rehabilitation and multiple surgeries, she defied all odds. In September last year, Wang announced the birth of her son through in vitro fertilisation (IVF), a moment of joy celebrated by her millions of online supporters.However, fate tested her resilience once again. At birth, her son was diagnosed with congenital heart disease. Since he was three months old, he has undergone regular medical check-ups, surgery, and rehabilitation. Through it all, Wang remains steadfast in her love and hope for his future.“I want to assure my baby, do not be afraid, Mummy is always here, and I will be by your side as you grow up healthy,” she shared in an interview.Her journey has resonated deeply with many, including mothers who have faced similar struggles. One woman reached out to share her own experience, saying, “Nuannuan, my child also had a severe heart issue. At seven months, he underwent a 16-hour surgery in Shanghai, and now he is seven years old and thriving.”Rebuilding a lifeNow based in Hangzhou, Wang has turned her online presence into a source of strength and financial stability. With 4.6 million followers on Douyin, she shares glimpses of her life while live-streaming baby products and snacks. Her social media has become more than just a platform—it’s a space where she finds support and inspires others with her perseverance.Also read: ‘Mum, your mindset is far too harmful’: Teen urges mother to embrace self-love in viral videoYet, the shadows of her past still linger. Yu Xiaodong, the man who tried to end her life, was sentenced to 33 years and four months in prison by a Thai court. But despite the severity of his crimes, their divorce remains unresolved. Shockingly, Wang revealed in December that Yu is demanding 30 million yuan (approximately ₹35 crore) in compensation, claiming emotional distress and loss of youth while in prison. Authorities in both China and Thailand are still working through the legal complexities of the case.Through every trial, Wang has refused to be defined by her pain. Instead, she has become a beacon of resilience, proving that even after the darkest storms, it is possible to rebuild. As messages of support continue to flood in, she stands as an inspiration to millions—showing that strength is not just about survival but about choosing to fight for a better future.Also read: 10-year-old British boy sets world record by memorising 280 digits of Pi in one minute ",
    "news": {
      "key_points": [
        "Wang Nan survived a near-fatal fall from a cliff in 2019 when her husband attempted to kill her.",
        "She gave birth to a son via IVF, who was later diagnosed with congenital heart disease.",
        "Wang has gained 4.6 million followers on Douyin, sharing her journey and inspiring others."
      ],
      "detailed_points": [
        "Wang Nan was attacked by her husband in Thailand over financial motives, resulting in severe injuries and the loss of her unborn child.",
        "After extensive rehabilitation, she achieved her dream of motherhood through IVF in September 2022.",
        "Her newborn son faces health challenges, undergoing regular treatment for congenital heart disease since birth.",
        "Wang uses her social media platform not only to connect with followers but also to promote baby products, ensuring financial stability.",
        "While her husband's prison sentence is lengthy, he is demanding compensation in their unresolved divorce, adding complexity to her situation."
      ],
      "genz_version": "OMG, y'all! So, like, Wang Nan totally bounced back after her hubby tossed her off a cliff in Thailand for cash—like, what? She gave birth to her baby boy through IVF, but he's dealing with some serious heart issues. Now, she's vibing with 4.6M fans on Douyin, sharing her life and keeping it real. But her ex is still trying to get money from her, like, how toxic? She's a real-life inspo, proving you can glow up after the drama!",
      "paragraph": "Wang Nan, a Chinese woman who survived a horrific attack by her husband in Thailand, has shared her inspiring journey as a mother. After giving birth to her son through IVF, he was diagnosed with congenital heart disease, requiring ongoing medical care. With millions of online supporters, Wang uses her platform to raise awareness and find strength, all while navigating the challenges from her past."
    }
  },
  {
    "title": "Pawan Kalyan's Hindi Comments Spark Backlash",
    "link": "https://www.hindustantimes.com/india-news/prakash-raj-slams-andhra-pradesh-deputy-cm-pawan-kalyan-don-t-impose-your-hindi-language-on-us-101742034936186.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/prakash_raj_1742035172153_1742035183012.jpg",
    "provider": "Hindustan Times",
    "rawdes": "Andhra Pradesh deputy chief minister Pawan Kalyan's remarks on Hindi language have drawn massive ire from the opposition and netizens alike, with actor-politician Prakash Raj also joining in now in attacking the Jana Sena party chief.In a post on X, Prakash Raj slammed Kalyan and accused him of trying to ",
    "news": {
      "key_points": [
        "Andhra Pradesh Deputy CM Pawan Kalyan criticized Hindi language.",
        "Actor-Prakash Raj and opposition reacted strongly to Kalyan's remarks.",
        "The controversy reflects ongoing tensions over language politics in India."
      ],
      "detailed_points": [
        "Pawan Kalyan, the deputy chief minister of Andhra Pradesh, made controversial remarks regarding the Hindi language.",
        "His comments have incited a strong backlash from opposition parties and netizens.",
        "Notable actor and politician Prakash Raj has publicly condemned Kalyan's statements.",
        "The incident highlights the ongoing debates in India about regional languages and cultural identity.",
        "The situation illustrates the heightened sensitivities surrounding language use in Indian politics."
      ],
      "genz_version": "Yo, so Pawan Kalyan, the Andhra Pradesh deputy CM, just dropped some spicy takes on Hindi and people are NOT vibing with it! Everyone’s clapping back, including actor Prakash Raj who's like 'nah, fam!' This drama is just another reminder that language wars are real in India, and folks are hella passionate about their regional identities. #LanguagePolitics #KalyanDrama",
      "paragraph": "Pawan Kalyan, the Deputy Chief Minister of Andhra Pradesh, faced severe backlash after making remarks about the Hindi language. Opposition leaders and netizens expressed their anger, with actor-politician Prakash Raj also criticizing Kalyan. This incident underscores the longstanding tensions regarding language and identity in Indian politics, reflecting broader discussions about regional languages and cultural representation."
    }
  },
  {
    "title": "Politics Gets Personal: Pawan Kalyan vs. DMK",
    "link": "https://www.hindustantimes.com/india-news/dmk-leader-pawan-kalyans-tamil-films-dubbed-in-hindi-remark-he-wasnt-even-born-when-101742033229510.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2025/03/15/1600x900/Tamil-Nadu-Hindi-row-DMK-TKS-Elangovan_1742033887644_1742033887888.png",
    "provider": "Hindustan Times",
    "rawdes": "In response to actor-turned-politician Pawan Kalyan’s ‘movie dubbing’ remarks on the ongoing Hindi language row in Tamil Nadu, leader of ruling DMK, TKS Elangovan, accused him of hypocrisy saying that “he doesn't know anything about state politics.”The exchange comes amid rising controversy over the three-language issue under the National Education Policy (NEP) 2020.Pawan Kalyan, who is also the deputy chief minister of Andhra Pradesh, criticised the Tamil Nadu politicians for what he called ",
    "news": {
      "key_points": [
        "Pawan Kalyan criticized Tamil Nadu politicians over language policies.",
        "DMK leader TKS Elangovan accused Kalyan of hypocrisy.",
        "The controversy centers around the three-language policy of NEP 2020."
      ],
      "detailed_points": [
        "Pawan Kalyan, a prominent actor and deputy CM, spoke against Tamil Nadu's stance on Hindi language.",
        "His comments sparked backlash from DMK leaders, particularly TKS Elangovan.",
        "Elangovan labeled Kalyan's remarks as hypocritical, questioning his understanding of state politics.",
        "The debate is tied to the national education policy which promotes a three-language formula.",
        "This issue has significant implications for regional language politics and education in India."
      ],
      "genz_version": "So, Pawan Kalyan threw shade at Tamil Nadu peeps for their Hindi drama, right? DMK’s TKS Elangovan clapped back, calling him a total hypocrite and saying he knows nada about state politics. This whole thing is blowing up because of that NEP 2020 three-language policy vibe. It’s a major tea, fam!",
      "paragraph": "Pawan Kalyan's criticism of Tamil Nadu politicians regarding the Hindi language sparked a strong response from DMK leader TKS Elangovan, who accused him of hypocrisy and ignorance about state politics. This exchange unfolds against the backdrop of the ongoing debate over the National Education Policy (NEP) 2020, which emphasizes a three-language framework."
    }
  },
  {
    "title": "Sikkim Bridge Collapse Crisis: Trucks to Blame!",
    "link": "https://www.hindustantimes.com/india-news/uncontrolled-movement-of-overloaded-trucks-damage-four-bridges-in-north-sikkim-bro-101742034412013.html",
    "image": "https://www.hindustantimes.com/ht-img/img/2024/12/18/1600x900/India_7_1734523831601_1734523847734.jpg",
    "provider": "Hindustan Times",
    "rawdes": " Gangtok, As many as four bridges in North Sikkim have either collapsed or got severely damaged in North Sikkim in the past two months due to the movement of overloaded trucks on those bridges, an official release by Project Swastik said on Saturday. Project Swastik is undertaken by the Border Roads Organisation to enhance infrastructure and connectivity in the border regions of Sikkim, particularly in North Sikkim. ",
    "news": {
      "key_points": [
        "Four bridges in North Sikkim collapsed or damaged.",
        "Overloaded trucks caused the structural failures.",
        "Project Swastik aims to improve infrastructure in border areas."
      ],
      "detailed_points": [
        "Recent reports indicate four bridges in North Sikkim have either collapsed or been severely damaged over the past two months.",
        "The damage is attributed to the movement of overloaded trucks on these bridges.",
        "Project Swastik, led by the Border Roads Organisation, focuses on enhancing infrastructure in border regions.",
        "The situation raises concerns about road safety and connectivity in North Sikkim.",
        "Efforts will be needed to assess the infrastructure and implement weight limits for trucks."
      ],
      "genz_version": "Yo fam, crazy news! Four bridges in North Sikkim just straight-up collapsed 'cause trucks were overloaded. Like, seriously? Project Swastik, which is all about boosting the roads and stuff, is keeping it in check, but they gotta hustle to fix these vibes. Safety’s a big mood, and we need those roads lit again! #BridgeFails",
      "paragraph": "In North Sikkim, four bridges have either collapsed or suffered severe damage in the last two months due to overloaded trucks. This issue has been highlighted by Project Swastik, an initiative by the Border Roads Organisation aimed at improving infrastructure and connectivity in the region. The situation poses serious challenges for road safety and accessibility in these border areas."
    }
  },
  {
    "title": "Trump Vows to Clean Up D.C. for World Leaders",
    "link": "https://timesofindia.indiatimes.com/world/us/did-not-want-pm-modi-others-to-see-tents-graffiti-potholes-in-dc-trump-cites-pms-us-visit-in-doj-speech/articleshow/119030177.cms",
    "image": "https://static.toiimg.com/thumb/msid-119032333,imgsize-801282,width-400,resizemode-4/119032333.jpg",
    "provider": "The Times of India",
    "rawdes": "The US President Donald Trump made a reference to PM Modi's visit to the US while delivering a speech at the Department of Justice (DOJ) on Friday. He made the mention as he expressed his desire to present a clean and safe image of Washington DC to visiting world leaders, including Prime Minister Modi, talking about the importance of removing tents and graffiti near federal buildings. \"When Prime Minister Modi of India, the President of France, and all of these people… Prime Minister of the United Kingdom, they all came to see me over the last week and a half. And when they come in…I had the route run. I didn't want to have them see tents. I didn't want to have them see graffiti. I didn't want to have them see broken barriers and potholes in the roads. And we had it looking beautiful,\" Trump said. While delivering his remarks, Trump outlined plans for city improvement, highlighting efforts to eliminate crime, remove graffiti and dismantle tents in collaboration with the administration. \"We're cleaning up our city. We're cleaning up this great capital, and we're not going to have crime, and we're not going to stand for crime, and we're going to take the graffiti down, and we're already taking the tents down, and we're working with the administration,\" also said Trump. He acknowledged Mayor Muriel Bowser's effective efforts in cleaning the capital, noting the swift removal of tents located opposite the State Department. \"We said there are tents galore right opposite the State Department. They have to come down. And they took them down right away. And so so far, so good. We want to have a capital that can be the talk of the world,\" the US President added to his statement. The President committed to transforming Washington DC into a crime-free capital where visitors would feel secure without fears of mugging, shooting or assault. \"We're going to have a crime-free capital. When people come here, they're not going to be mugged or shot or raped. They're going to have a crime-free capital, again, it's going to be cleaner and better and safer than it ever was and it's not going to take us too long,\" said Trump. https://www.youtube.com/watch?v=6i41Av4eYO8 PM Modi's White House visit for bilateral discussions occurred on February 13, making him the fourth international leader to meet Trump following his January inauguration. In the initial month of Trump's second term, he welcomed Israeli Prime Minister Benjamin Netanyahu, Japanese Prime Minister Shigeru Ishiba and Jordan's King Abdullah II. The US President's recent diplomatic engagements also included meetings with French President Emmanuel Macron and UK Prime Minister Keir Starmer amongst other foreign leaders during his second term. Meanwhile, during his DOJ speech, Trump also took a jab at former President Joe Biden. He criticised Biden's administration, stating that they had transformed the Department of Justice (DOJ) into a \"Department of Injustice\". Trump delivered these comments at the Department of Justice after numerous Biden-era judges, attorneys and officials were either dismissed or resigned under the current administration. Speaking as the Chief Law Enforcement Officer, Trump declared that the previous administration's approach to justice had ended permanently. \"Our predecessor turned the Department of Justice into a Department of Injustice, but I stand before you to declare that those days are over, and they are never coming back. And now, as the Chief Law Enforcement Officer of our country, I will insist upon and demand accountability for all the wrongs and abuse that have occurred,\" Trump said. Trump alleged that investigators had conducted surveillance on his campaign and initiated multiple hoax and disinformation operations. He further stated that they had targeted his family, staff and supporters, conducted a search of his Mar-a-Lago residence, and attempted to prevent him from assuming the presidency of the United States.",
    "news": {
      "key_points": [
        "Trump emphasizes the need for a clean Washington D.C. for visiting leaders.",
        "He criticizes Biden's DOJ, calling it a 'Department of Injustice.'",
        "Plans to eliminate crime and improve safety in the capital were discussed."
      ],
      "detailed_points": [
        "President Trump highlighted the importance of presenting a clean image of D.C. to global leaders, including PM Modi.",
        "He announced initiatives to remove tents and graffiti near federal buildings for a better impression.",
        "Trump noted collaboration with Mayor Muriel Bowser in city improvement efforts.",
        "During his speech, he condemned the previous administration's handling of the DOJ, vowing to restore accountability.",
        "The speech coincided with Trump's recent diplomatic engagements with foreign leaders."
      ],
      "genz_version": "So, like, Trump just gave this speech at the DOJ, right? He was all like, 'We gotta make D.C. look lit for our world leaders, ya know? No tents or graffiti!' He also threw shade at Biden, calling the DOJ a total mess. Basically, he’s out here trying to turn D.C. into a vibe where no one feels sketchy or scared. Let’s see if he can actually pull it off! #CleanUpDC",
      "paragraph": "In a recent speech at the Department of Justice, President Trump stressed the need to present a clean and safe Washington D.C. to visiting world leaders, including Prime Minister Modi. He announced plans to eliminate crime, graffiti, and unsightly tents, while criticizing the Biden administration's legacy at the DOJ. Trump aimed to transform the capital into a secure destination free from fear for visitors."
    }
  },
  {
    "title": "BJP Leader Shot Over Land Feud in Haryana",
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/bjp-leader-surendra-jawahra-shot-dead-over-land-dispute-in-haryana/articleshow/119033218.cms",
    "image": "https://static.toiimg.com/thumb/msid-119033308,imgsize-16492,width-400,height-225,resizemode-72/119033308.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: BJP leader Surendra Jawahra was allegedly shot dead by his neighbour over a land dispute on Friday night in Haryana's Sonipat, police said on Saturday. The incident occurred at around 9.30pm. ACP Crime Rishikant stated that they received information about firing in Jawahra village and the village headman Surendra had been shot. \"We received information yesterday that there had been firing in Jawahra village and 'nambardar' (village headman) Surendra, had been shot. FIR has been registered and three teams have been formed. The accused will be arrested soon. The reason behind the death is a land dispute with a neighbour,\" ACP Crime Rishikant said. Rishikant further stated that an FIR had been registered, three investigative teams had been formed, and the accused would be apprehended soon. Another similar incident was reported in Punjab. Between Thursday and Friday night, unidentified assailants fatally attacked Shiv Sena Moga district president Mangat Rai, police officials confirmed. During the assault on the stadium road of Moga, an 11-year-old boy, unrelated to Mangat, suffered injuries when the attackers opened fire. Both victims were rushed to Moga civil hospital where doctors pronounced the 55-year-old Shiv Sena leader dead. Reports indicate that Mangat left his residence after 10 pm to purchase milk when several individuals began following him. The attackers initially fired at him from behind but missed. As Mangat attempted to escape, three unidentified individuals on a motorcycle pursued him and shot at him again. Additionally, authorities reported a separate shooting incident at a Moga salon during the same period. Key highlights: BJP leader Surendra Jawahra was shot dead by his neighbor in Haryana's Sonipat over a land dispute. The incident occurred around 9.30pm on Friday night, leading to an FIR and formation of three investigative teams. ACP Crime Rishikant assured that the accused would be arrested soon as the investigation progresses.",
    "news": {
      "key_points": [
        "BJP leader Surendra Jawahra shot dead in Sonipat.",
        "Incident occurred during a land dispute with a neighbor.",
        "Police have registered an FIR and formed three investigative teams."
      ],
      "detailed_points": [
        "Surendra Jawahra, a BJP leader, was shot dead on Friday night in Jawahra village, Haryana.",
        "The shooting was linked to a land dispute with his neighbor.",
        "Police confirmed that a First Information Report (FIR) has been filed.",
        "Three investigative teams have been established to capture the suspect.",
        "In a related incident, another political figure, Mangat Rai, was killed in Punjab amid similar violence."
      ],
      "genz_version": "Yo, so a BJP dude named Surendra Jawahra just got shot by his neighbor over some land drama in Haryana. Total chaos went down around 9:30 PM! Police are on it, filing reports and chasing suspects with three squads on the case. Wild, right? And it's extra messy because another poli-guy just got capped in Punjab too. Stay safe, fam!",
      "paragraph": "Surendra Jawahra, a BJP leader, was shot dead in Sonipat, Haryana, on Friday night due to an ongoing land dispute with his neighbor. The police have registered an FIR and formed three investigative teams to ensure the suspect's arrest. This incident highlights a troubling trend of political violence, as another leader was recently killed in a separate attack in Punjab."
    }
  },
  {
    "title": "Top ISIS Leader Taken Out in Precision Strike!",
    "link": "https://timesofindia.indiatimes.com/world/us/terrorists-wore-unexploded-suicide-vests-video-shows-us-missile-strike-on-isis-leader-abu-khadijah/articleshow/119032594.cms",
    "image": "https://static.toiimg.com/thumb/msid-119033420,imgsize-5225417,width-400,resizemode-4/119033420.jpg",
    "provider": "The Times of India",
    "rawdes": "In a joint operation earlier this week, US Central Command (CENTCOM) forces, in coordination with Iraqi Intelligence and Security Forces killed top ISIS leader Abdallah Makki Muslih al-Rifai, also known as \"Abu Khadijah.\" The second-highest-ranking ISIS leader and the group’s chief of global operations was killed in a precision airstrike along with another ISIS operative, as revealed by Centcom. \"On March 13, US Central Command forces, in cooperation with Iraqi Intelligence and Security Forces, conducted a precision airstrike in Al Anbar Province, Iraq, that killed the Global ISIS #2 leader, Chief of Global Operations and the Delegated Committee Emir – Abdallah Makki Muslih al-Rifai, alias “Abu Khadijah”, and one other ISIS operative,\" said the US central command Following the airstrike, Centcom and Iraqi forces secured the site, where they identified Abu Khadijah through DNA matching from a previous raid. \"After the strike, CENTCOM and Iraqi forces moved to the strike site and found both dead ISIS terrorists. Both terrorists were wearing unexploded “suicide vests” and had multiple weapons,\" also said the US forces in their statement. Gen. Michael Erik Kurilla, commander of US Central Command, highlighted the significance of the operation, stating, \"Abu Khadijah was one of the most important ISIS members in the entire global ISIS organization. We will continue to kill terrorists and dismantle their organisations that threaten our homeland and US, allied, and partner personnel in the region and beyond.\" Earlier, President Donald Trump announced the killingof the ISIS leader in Iraq by US along with Iraqi and Kurdish forces. \"Today the fugitive leader of ISIS in Iraq was killed. He was relentlessly hunted down by our intrepid warfighters,\" Trump said in a post on Truth Social. Further, sharing credit with Iraq and Kurdish forces, he added, \"His miserable life was terminated, along with another member of ISIS, in coordination with the Iraqi Government and the Kurdish Regional Government. PEACE THROUGH STRENGTH!\" The strike marks a major blow to ISIS leadership and is part of ongoing U.S. efforts to combat the terrorist organization. Read more: 'Fugitive' ISIS leader in Iraq 'relentlessly hunted down' and killed, says Trump Who was ISIS 'fugitive' leader Abu Khadijah Abu Khadijah held a key leadership position as the Emir of ISIS' most senior decision-making body, responsible for overseeing the group’s global operations, logistics, and financial planning. \"As the Emir of ISIS’ most senior decision-making body, Abu Khadijah maintained responsibility for operations, logistics, and planning conducted by ISIS globally, and directs a significant portion of finance for the group’s global organization,\" said the Centcom in its statement. Considered one of the deadliest terrorists active in Iraq and internationally, his significant role in ISIS's leadership hierarchy made him a prominent figure, and his status within the organisation had previously led to speculation about potential consideration to the position of ISIS's global leader, known as the \"caliph\".",
    "news": {
      "key_points": [
        "US forces kill Abu Khadijah, ISIS's #2 leader, in Iraq.",
        "The operation was supported by Iraqi Intelligence and Kurdish forces.",
        "Abu Khadijah was a key figure overseeing ISIS's global operations."
      ],
      "detailed_points": [
        "US Central Command conducted a precision airstrike on March 13, resulting in the death of top ISIS leader Abdallah Makki Muslih al-Rifai, aka Abu Khadijah.",
        "The strike occurred in Al Anbar Province, Iraq, and also killed another ISIS operative.",
        "Abu Khadijah was identified through DNA matching from a previous raid.",
        "Gen. Michael Erik Kurilla emphasized the operation's significance in countering terrorist threats.",
        "The operation marks a critical blow to ISIS's leadership amid ongoing US efforts to combat the organization."
      ],
      "genz_version": "Yo fam, big news! US troops just clapped back hard at ISIS, taking out their #2 dude, Abu Khadijah, in a precision airstrike in Iraq. This guy was a major player in global ops and logistics for the squad. Ain't no chill for terrorists! Props to the Iraqi and Kurdish homies who helped out. Major W for peace, for real!",
      "paragraph": "In a major counter-terrorism operation, US Central Command forces, alongside Iraqi Intelligence, killed ISIS leader Abdallah Makki Muslih al-Rifai, known as Abu Khadijah, in a precision airstrike in Iraq's Al Anbar Province. The strike, significant in dismantling ISIS’s leadership, eliminated a key figure overseeing global operations and logistics for the terrorist group."
    }
  },
  {
    "title": "Aamir Khan Goes Public With New Love!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/aamir-khan-on-getting-married-for-the-third-time-with-girlfriend-gauri-spratt-60-saal-ki-umar-mein-shaadi-shayad-mujhe-shobha-nahi-degi-/articleshow/119009460.cms",
    "image": "https://static.toiimg.com/thumb/msid-119009439,imgsize-38876,width-400,resizemode-4/119009439.jpg",
    "provider": "The Times of India",
    "rawdes": "On the eve of his 60th birthday, Aamir Khan surprised the nation by introducing his new partner, Gauri Spratt, to the media. This move marked a significant moment in his personal life, as he openly discussed his relationship and future plans with Gauri. The couple has been dating for over a year. Aamir and Gauri Spratt first met 25 years ago but lost touch due to their busy lives. However, two years ago, they reconnected, and their relationship blossomed. Aamir expressed his feelings about Gauri, saying, \"I was looking for someone who I can be calm with, who gives me peace. And there she was.\" This reconnection has brought a new sense of peace and companionship into his life. See more: Did Gauri Spratt remove her social media account after Aamir Khan’s 60th Birthday leak? When asked why he decided to go public with his relationship, Aamir explained, \"We are committed now, and we felt we were secure enough in each other to tell you guys. And this is better; I won't have to hide things now. Tomorrow, if I go for a coffee with her, you guys can join us, too.\" See more: Aamir Khan on getting married for the third time with girlfriend Gauri Spratt: “60 saal ki umar mein shaadi shayad mujhe shobha nahi degi.” The ‘PK’ actor has been married twice before, to Reena Dutta and Kiran Rao, and has three children from these marriages. When questioned about his marriage plans with Gauri, he humorously replied, \"See, we are fully committed. And I have been married twice. Par ab 60 saal ki umar mein shaadi shayad mujhe shobha nahi degi (Marriage at the age of 60 would not suit me). But let's see.\" Gauri Spratt told the Deccan Herald that Aamir Khan's family welcomed her warmly. \"They met me with open arms,\" she said, adding, \"I felt very welcomed.\" Her experience was positive, as she felt embraced by his family. Gauri appreciated the warmth and kindness shown to her by Aamir's family, making her feel at ease. This positive reception made her feel part of the family. See more: Who is Gauri Spratt: Aamir Khan introduces his Bengaluru-based girlfriend Gauri Spratt is from Bengaluru and is the mother of a six-year-old child. As per multiple reports and LinkedIn profiles, she has been working as a partner and director with a popular salon since 2007 and holds a degree in fashion, styling, and photography from the University of Arts, London. Despite her connection to Aamir Khan, Gauri prefers to keep her personal life private, which is why Aamir requested that photographers not share her photos on social media. Aamir has been preparing Gauri for the intense media scrutiny that comes with being in a relationship with a Bollywood star. He has even hired private security for her, stating that it gives him \"personal peace of mind. In a world where personal lives often face public scrutiny, Aamir Khan and Gauri Spratt's relationship stands as a testament to genuine connection and the pursuit of happiness, proving that love can flourish even amidst the chaos of fame. https://www.instagram.com/reel/DHJVtBtvKqh/https://www.instagram.com/reel/DHJVtBtvKqh/",
    "news": {
      "key_points": [
        "Aamir Khan introduces girlfriend Gauri Spratt ahead of his 60th birthday.",
        "They rekindled their relationship after 25 years apart.",
        "Aamir humorously hints at marriage but doubts it's suitable at his age."
      ],
      "detailed_points": [
        "Aamir Khan and Gauri Spratt were friends 25 years ago before losing touch and reconnecting two years back.",
        "Gauri has a six-year-old child and works as a partner and director at a salon.",
        "Aamir emphasized their commitment, saying they now feel secure enough to share their relationship publicly.",
        "Gauri reported a warm welcome from Aamir's family, which helped her feel accepted.",
        "To protect Gauri from media scrutiny, Aamir has hired private security and requested that her photos not be shared online."
      ],
      "genz_version": "OMG, Aamir Khan just dropped the biggest news before turning 60! 🎉 He’s dating Gauri Spratt, and they’ve been vibing for over a year after reconnecting from like, way back! 💫 Aamir’s all about that chill life now, saying he found peace. 🕊️ Gauri feels super welcomed by his fam, but Aamir's keeping her low-key from the paps, giving her the VIP treatment. #LoveWins #AamirAndGauri",
      "paragraph": "On the eve of his 60th birthday, Aamir Khan revealed his relationship with Gauri Spratt, who he has been dating for over a year after reconnecting 25 years after their first meeting. Aamir expressed their mutual commitment and shared feelings about finding peace in their relationship. Gauri felt warmly welcomed by Aamir's family, while Aamir takes measures to ensure her privacy amid media attention."
    }
  },
  {
    "title": "Indian Student Deports After Visa Revoked for Hamas Support",
    "link": "https://timesofindia.indiatimes.com/world/us/indian-scholar-at-columbia-university-ranjani-srinivasan-self-deports-after-visa-revocation-accused-of-supporting-hamas/articleshow/119024743.cms",
    "image": "https://static.toiimg.com/thumb/msid-119024880,imgsize-883225,width-400,resizemode-4/119024880.jpg",
    "provider": "The Times of India",
    "rawdes": "The US Department of Homeland Security (DHS) has announced that an Indian doctoral student from Columbia University, whose visa was revoked for allegedly supporting Hamas, has voluntarily left the United States. The student, Ranjani Srinivasan, used the CBP Home App to self-deport on March 11, 2025, after the Department of State cancelled her visa on March 5 due to security concerns. Secretary of Homeland Security Kristi Noem confirmed the self-deportation and issued a statement saying, “It is a privilege to be granted a visa to live and study in the United States of America. When you advocate for violence and terrorism, that privilege should be revoked, and you should not be in this country. I am glad to see one of the Columbia University terrorist sympathizers use the CBP Home App to self-deport.” Srinivasan’s case comes amid increased scrutiny of foreign students in the US following pro-Palestinian protests on college campuses. Another Columbia student, Leqaa Kordia, a Palestinian from the West Bank, was arrested by ICE Homeland Security Investigations (HSI) officers in Newark for overstaying her F-1 student visa, which had expired on January 26, 2022. Kordia had previously been arrested in April 2024 for participating in pro-Hamas protests at Columbia University. Also read: Who is Ranjani Srinivasan? Why did the US revoke the Indian scholar's visa? The DHS has not released further details about Srinivasan’s alleged activities but confirmed that video footage of her departure using the CBP Home App had been obtained. Who is Ranjani Srinivasan? Ranjani Srinivasan is an Indian national who was pursuing a doctoral degree in Urban Planning at Columbia University. A Fulbright recipient, she holds an M.Phil in Urban Planning from Columbia University’s Graduate School of Architecture, Planning, and Preservation (GSAPP), a Master’s in Design from Harvard University’s Graduate School of Design, and a Bachelor of Design (B.Des.) from CEPT University in India. According to Srinivasan’s bio on NYU Wagner’s official website, her research focuses on “the evolving nature of land-labour relations in peri-urban statutory towns in India,” with broader interests in “the political economy of development, the spatial politics of land, and the sociology of labour.” The US government has not disclosed additional details regarding the specific reasons behind the visa revocation beyond allegations of supporting Hamas.",
    "news": {
      "key_points": [
        "Ranjani Srinivasan, an Indian doctoral student, self-deported from the US after her visa was revoked.",
        "Her visa cancellation was due to allegations of supporting Hamas, confirmed by DHS Secretary Kristi Noem.",
        "Another Columbia student, Leqaa Kordia, was arrested for overstaying her visa and protesting pro-Hamas. "
      ],
      "detailed_points": [
        "Ranjani Srinivasan used the CBP Home App for self-deportation on March 11, 2025, after her visa was canceled on March 5.",
        "DHS Secretary Kristi Noem emphasized the importance of revoking visas for those advocating violence and terrorism.",
        "Srinivasan was pursuing a doctoral degree in Urban Planning at Columbia University and was a Fulbright recipient.",
        "Her research focused on land-labour relations in India, showcasing her academic credentials and background.",
        "The US has heightened scrutiny of foreign students amidst rising pro-Palestinian demonstrations on campuses."
      ],
      "genz_version": "Yo, so Ranjani Srinivasan, this Indian grad student from Columbia, bailed outta the US after her visa got yanked for allegedly being pro-Hamas. She self-deported using some app on March 11, 2025, all thanks to Homeland Security snapping back. Like, Sec. Kristi Noem was super serious about kicking out anyone vibing with violence. Total drama, right?",
      "paragraph": "Ranjani Srinivasan, an Indian doctoral student at Columbia University, voluntarily self-deported on March 11, 2025, after the US government revoked her visa due to allegations of supporting Hamas. DHS Secretary Kristi Noem confirmed this action, emphasizing the government's stance against violence advocates. This comes as scrutiny of foreign students grows amid pro-Palestinian protests in the US."
    }
  },
  {
    "title": "Varun Chakravarthy: From Adversity to Stardom",
    "link": "https://timesofindia.indiatimes.com/sports/cricket/icc-champions-trophy-2025/after-2021-world-cup-i-received-threat-calls-dont-come-to-india-champions-trophy-winner-varun-chakaravarthy/articleshow/119028577.cms",
    "image": "https://static.toiimg.com/thumb/msid-119028755,imgsize-159230,width-400,resizemode-4/119028755.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: Once Jasprit Bumrah was ruled out of the Champions Trophy, few could have predicted the impact mystery spinner Varun Chakravarthy would go on to make. Drafted into the squad as the fifth spinner, Chakravarthy turned out to be India’s X-factor, finishing as the joint-highest wicket-taker with nine scalps in just three matches. Speaking to anchor Gobinath on his YouTube channel, the 33-year-old opened up about the dark phase after the 2021 T20 World Cup and how the recent success has helped him heal. \"It was a dark time for me. I was in depression because I thought I was not able to do justice after I was picked for the World Cup with a lot of hype,\" he said. \"I am not able to believe that all good things are happening in one go. I want to take it to the next level.\" Go Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW! Varun revealed that the backlash post-2021 was more than just criticism. \"After the 2021 World Cup, I received threat calls. 'Don't come to India. If you try, you won't be able to.' People came up to my house, tracked me down -- I had to hide at times. When I was returning from the airport, a couple of people followed me on their bikes. It happens. I can understand fans are emotional. But when I look back... I am happy.\" His selection for the ODI leg came as a surprise after the T20I series in Mumbai. \"I even got the tickets for Chennai. But the next morning, I was told that I was in the one-day team too and was asked to come to Nagpur.\" \"I think the Champions Trophy was a huge confidence booster,\" he added. \"I felt I belonged and that there was a place for me.\" With IPL 2025 around the corner, Chakravarthy, who will be donning the Kolkata Knight Riders colours, is focused on maintaining the momentum. READ ALSO: Why all 50 Pakistan cricketers went unpicked in The Hundred Draft",
    "news": {
      "key_points": [
        "Varun Chakravarthy was India's standout performer at the Champions Trophy, taking nine wickets in three matches.",
        "Following the 2021 T20 World Cup, Chakravarthy faced severe backlash, including threats and harassment.",
        "His recent success has helped him overcome personal struggles, including depression."
      ],
      "detailed_points": [
        "Chakravarthy was initially drafted as India's fifth spinner for the Champions Trophy.",
        "He opened up about the emotional turmoil he faced after disappointing in the 2021 T20 World Cup.",
        "The backlash included threats to his safety and privacy invasion from fans.",
        "His standout performance in the Champions Trophy has rejuvenated his confidence in his cricketing abilities.",
        "Chakravarthy aims to maintain this momentum as he prepares for IPL 2025 with Kolkata Knight Riders."
      ],
      "genz_version": "Yo, check it! Varun Chakravarthy just slayed it at the Champions Trophy, grabbing nine wickets! After that 2021 World Cup flop, he was in a dark place, facing crazy threats from fans. Like, people were wildin'! But now he’s feeling himself again, ready to smash it in IPL 2025 with KKR. Let's go! #ComebackKing",
      "paragraph": "Varun Chakravarthy emerged as a key player for India at the Champions Trophy, taking nine wickets in three matches after being selected as a late addition. The spinner shared his struggles post-2021 T20 World Cup, where he faced backlash and threats, leading to a period of depression. However, his recent success has boosted his confidence and he looks forward to continuing his momentum in the upcoming IPL season."
    }
  },
  {
    "title": "Tesla Takes a Big Step into India!",
    "link": "https://timesofindia.indiatimes.com/business/india-business/tesla-seeks-certification-for-2-ev-models-in-india/articleshow/119024179.cms",
    "image": "https://static.toiimg.com/thumb/msid-119024249,imgsize-634392,width-400,resizemode-4/119024249.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: Elon Musk-led Tesla Inc. initiated the process for the certification and homologation of two of its electric cars in India, which is an essential requirement for all vehicles before they can be sold in the country. Tesla India Motor & Energy Pvt. Ltd., the local unit of Musk's firm, submitted two new applications for homologation of the Model Y and Model 3 cars in India, according to industry sources. Homologation is the process of certifying that a vehicle is roadworthy and meets the norms laid out for all vehicles manufactured in India or imported into the country. The tests ensure that the vehicle matches the requirements of the Indian market in terms of emission, safety, and roadworthiness in accordance with the Central Motor Vehicle Rules. The company earlier submitted seven applications for homologation in India, which were meant for test cars. An eighth application was approved recently. The move comes amid talks with the US and India on a free trade agreement under which tariffs are expected to be lowered by both countries to enhance bilateral trade. Musk is keen to enter India as he looks for a foothold in the world's third-largest car market as an alternative to China, after the communist country came under strict US sanctions. While the Indian govt is keen for Musk to set up a plant in India to make Tesla for the local market, the billionaire wants to export the car to the country without any immediate manufacturing plans. Electric car sales in India recorded a 20% jump to 99,165 units in 2024, from 82,688 units in 2023. Tata Motors and JSW MG Motors are currently the market leaders. In addition, the luxury electric vehicle market also posted an increase in sales during the year, with 2,809 EVs sold by BMW, Mercedes Benz India, Volvo Cars India, Audi, and Porsche in 2024, up from 2,633 units in 2023. According to the Federation of Automobile Dealers Associations (FADA), the electric passenger vehicle retail sales in India grew by nearly 20%. The EV market is expected to continue growing, with industry forecasts predicting a compound annual growth rate (CAGR) of 43%. Govt initiatives and subsidies under the PM E-Drive scheme are also contributing to the growth of the EV market in India, as the country transitions to green energy in the fight against climate change. The electric two-wheeler segment recorded significant growth, with 1.13 million units sold in 2024, up from 860,000 units in 2023. The overall EV penetration in the country increased to 7.46% in 2024, up from 6.39s in 2023.",
    "news": {
      "key_points": [
        "Tesla submitted homologation applications for Model Y and Model 3 in India.",
        "Electric vehicle sales in India surged by 20% in 2024.",
        "Musk aims to expand Tesla's presence in India amid US-China tensions."
      ],
      "detailed_points": [
        "Tesla India Motor & Energy Pvt. Ltd. is seeking certification for Model Y and Model 3.",
        "Homologation ensures vehicles meet Indian emissions and safety standards.",
        "Tesla previously submitted seven applications for test cars; one was recently approved.",
        "The Indian EV market is projected to grow at a CAGR of 43% driven by government initiatives.",
        "Luxury EV sales also showed a rise, with notable brands increasing their market presence."
      ],
      "genz_version": "Yo fam! 🚗💨 So, like, Tesla's makin' moves in India, right? They just dropped apps to get their Model Y and 3 certified. Crazy how EV sales are up 20%! Musk's tryna vibe with India instead of China now. Let's go green, amirite? 🌱⚡️ #TeslaGoals #EVRevolution",
      "paragraph": "Tesla is moving closer to entering the Indian market by seeking homologation for its Model Y and Model 3 electric cars. This comes as the country's EV sales have surged by 20% in 2024, showing a growing market. Musk's plans may also align with potential US-India trade agreements, as he explores ways to establish a presence in the world's third-largest car market."
    }
  },
  {
    "title": "Bumrah and Sanjana Celebrate 4th Anniversary Amid Injury Woes",
    "link": "https://timesofindia.indiatimes.com/sports/off-the-field/happy-4-wife-sanjana-ganesan-pens-heartfelt-lyrics-for-jasprit-bumrah-on-anniversary/articleshow/119032580.cms",
    "image": "https://static.toiimg.com/thumb/msid-119033467,imgsize-27950,width-400,resizemode-4/119033467.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: Jasprit Bumrah and Sanjana Ganesan celebrated their fourth wedding anniversary on Friday, March 15, 2025, with a heartfelt exchange of love. Marking the special day, Sanjana shared a touching message featuring song lyrics that encapsulated her deep bond with the Indian pace spearhead. Sanjana marked her fourth wedding anniversary with Jasprit Bumrah by sharing heartfelt lyrics from the song \"Tu Hai Toh\" on Instagram. \"Tu hai toh dil dhadakta hai/Tu na toh ghar ghar nahi lagta/Tu hai to darr nahi lagta/Happy 4,\" wrote Bumrah's wife. The couple, who tied the knot in an intimate ceremony in Goa in 2021, welcomed their son, Angad, on September 4, 2023. While the celebration was all about love and togetherness, Bumrah’s absence from the field has been a topic of discussion. The Mumbai Indians pacer has been recovering from a lower back injury sustained during the fifth Test against Australia in January. The injury sidelined him from bowling in the second innings of the Sydney Test, which India lost by six wickets. As a result, Bumrah also missed India’s victorious Champions Trophy campaign, where the Men in Blue lifted the title without their premier fast bowler. His absence was a major blow, but the team management opted to give him ample time to recover, with an eye on the upcoming Test series against England in June. \"His recuperation is going well. But at this stage, it’s better to give him more time to return to peak fitness,\" a source told PTI. The BCCI medical team has not provided a definitive timeline for his return, but he has been gradually increasing his workload in the nets. Chief selector Ajit Agarkar had earlier advised five weeks of \"off-loading\" to manage stress on his back, considering his history of similar injuries. With IPL 2025 around the corner, Mumbai Indians will be hoping for Bumrah’s return, especially after their disappointing tenth-place finish last season. However, his availability for the initial games remains uncertain.",
    "news": {
      "key_points": [
        "Jasprit Bumrah and Sanjana Ganesan celebrated their 4th wedding anniversary.",
        "Sanjana shared heartfelt song lyrics on Instagram to mark the occasion.",
        "Bumrah is recovering from a back injury and missed recent matches."
      ],
      "detailed_points": [
        "Jasprit Bumrah and Sanjana Ganesan tied the knot in 2021 and welcomed their son in September 2023.",
        "Sanjana expressed her love through lyrics from the song 'Tu Hai Toh' on Instagram.",
        "Bumrah has been sidelined due to a lower back injury sustained in January against Australia.",
        "He missed crucial matches, including India's Champions Trophy victory without him.",
        "The BCCI is cautious about his recovery, aiming for his return for the upcoming Test series."
      ],
      "genz_version": "So, Jasprit Bumrah and Sanjana Ganesan just hit their 4-year anniversary, and it’s all the feels! Sanjana posted some super cute lyrics on IG, but like, Bumrah's still down with a back injury from that intense Australia match. He's been MIA, missing out on some big games. Everyone's low-key hoping he’s back for IPL 2025, but no cap, we just don't know when he'll be ready to roll!",
      "paragraph": "Jasprit Bumrah and Sanjana Ganesan celebrated their fourth wedding anniversary on March 15, 2025, with a sweet social media tribute. While Sanjana shared loving song lyrics, Bumrah continues to recover from a serious back injury, which has kept him off the field since January. As the IPL 2025 approaches, his return remains uncertain but is highly anticipated by fans and the Mumbai Indians."
    }
  },
  {
    "title": "Acid Attack Shocks Hyderabad Religious Community",
    "link": "https://timesofindia.indiatimes.com/city/hyderabad/acid-attack-in-telangana-temple-accountant-suffers-burn-injuries-on-face/articleshow/119031088.cms",
    "image": "https://static.toiimg.com/thumb/msid-119031190,imgsize-15680,width-400,height-225,resizemode-72/119031190.jpg",
    "provider": "The Times of India",
    "rawdes": "HYDERABAD: An accountant of a religious place suffered burn injuries after an unidentified person threw acid on his face in Saidabad. After the CCTV clip of the incident went viral on Friday night, the police beefed up security at the religious place. In the video, the incident took place around 7.30pm on Friday when a man was seen entering the place of worship with a bottle. The accused walked up to the victim, Narsign Rao, who was sitting on a chair, and poured acid on his head. After committing the crime, the accused fled the spot on a bike. The nearby locals rushed Rao to the hospital and alerted the police.",
    "news": {
      "key_points": [
        "Accountant Narsing Rao suffered severe burns from acid attack.",
        "Incident occurred at a religious place in Saidabad around 7:30 PM.",
        "Police have increased security after CCTV footage went viral."
      ],
      "detailed_points": [
        "Narsing Rao was attacked by an unidentified assailant who poured acid on his face.",
        "The attack took place in a place of worship, raising concerns for safety.",
        "CCTV footage of the incident has led to public outrage and police action.",
        "Locals quickly responded by taking Rao to the hospital and notifying authorities.",
        "Authorities are investigating the motive behind the attack and searching for the suspect."
      ],
      "genz_version": "Yo fam, so like, this accountant dude Narsing Rao got totally wrecked when some random person threw acid on him at this religious spot in Saidabad, around 7:30 PM. 😱 The video of it blew up online, and now the cops are all over the place makin' sure it doesn’t happen again. Props to the locals for rushing him to the hospital! 🚑 Now the police are on the hunt for the bike dude who pulled this wild stunt. #NotCool",
      "paragraph": "In Hyderabad's Saidabad, an accountant named Narsing Rao suffered burn injuries after an unidentified individual threw acid on his face at a religious location. The attack occurred around 7:30 PM, and following the incident's viral CCTV footage, police have increased security at the site. Locals rushed Rao to the hospital as the perpetrator fled on a bike, prompting an ongoing investigation."
    }
  },
  {
    "title": "Actress Ranya Rao's Gold Smuggling Bail Verdict Delayed",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/holds-uae-resident-identity-card-how-karnataka-dgps-daughter-ranya-rao-cleared-airport-checks-with-vip-help/articleshow/118962057.cms",
    "image": "https://static.toiimg.com/thumb/msid-118962061,imgsize-14850,width-400,height-225,resizemode-72/118962061.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: A Bengaluru Special Court for Economic Offences has reserved its verdict on Kannada actress Ranya Rao’s bail plea in the gold smuggling case, with the judgment expected on March 14. During the hearing, Senior Advocate Kiran Javali, representing Rao, argued that the Directorate of Revenue Intelligence (DRI) failed to follow due legal procedures during her arrest and questioning. He claimed the arrest memo did not explicitly mention the \"grounds of arrest,\" violating the Supreme Court's DK Basu guidelines. Javali contended that such lapses warrant bail, irrespective of the severity of the allegations. The DRI, opposing the bail, emphasized the gravity of the charges against Rao, who was arrested at Bengaluru's Kempegowda International Airport on March 3 with 14 kg of gold. Prosecutors argued that releasing her could disrupt the ongoing investigation and lead to evidence tampering or witness intimidation. Ranya Rao has alleged mistreatment during her detention, claiming DRI officials verbally abused her and pressured her into signing documents without proper consent. The DRI, however, dismissed these claims, asserting that all protocols were followed lawfully. The agency also revealed that Rao had managed to clear immigration and the Green Channel with assistance from the State Protocol Office before being intercepted just outside the airport exit. This has raised serious concerns over the involvement of state officials in the smuggling racket. Meanwhile, a fresh controversy erupted after the Karnataka government withdrew its approval for a CID probe into the alleged police escort provided to Rao at the airport. Sources suggest the abrupt U-turn came under pressure from influential circles, fearing revelations from a police constable who was intercepted while escorting Rao could implicate senior officials. The state home department defended the move, stating that a separate probe led by senior IAS officer and Additional Chief Secretary Gaurav Gupta was already underway to examine the role of the state protocol wing and DGP Ramachandra Rao, Ranya’s father. Basavaraj, a head constable from the airport police station, told the CBI on Tuesday that he had merely followed \"oral instructions from senior IPS officers\" regarding receiving and dropping off their family members at the airport. However, he denied any knowledge of the gold smuggling. Investigators are now probing who exactly ordered Basavaraj to escort Rao during her travels. The CBI has already questioned Basavaraj and two other officials in an attempt to reconstruct the events leading up to Rao’s arrest. Sources indicate that the actress had directly contacted the constable before her arrival from Dubai, suggesting a prior arrangement. Public prosecutor Madhu N Rao, representing the DRI, reiterated the agency’s firm stance against granting bail. “We oppose the bail petition since it is a matter of national security. The accused is not cooperating with us. The incident indicates that an established syndicate is working behind (gold smuggling), and we have to investigate the hawala angle, too,” he said. The DRI has also summoned the protocol officer who allegedly assisted Rao. Additionally, the agency revealed that the actress holds a UAE resident identity card, adding another layer to the investigation.",
    "news": {
      "key_points": [
        "Bengaluru court reserves bail verdict for actress Ranya Rao.",
        "Rao allegedly caught smuggling 14 kg of gold at the airport.",
        "Directorate of Revenue Intelligence opposes the bail citing national security."
      ],
      "detailed_points": [
        "Ranya Rao's bail hearing concluded, with a decision expected March 14.",
        "Senior Advocate claims DRI failed to follow legal procedures in her arrest.",
        "Prosecutors warn of potential evidence tampering if Rao is released.",
        "A CID probe into potential police involvement has been withdrawn by the Karnataka government.",
        "Rao holds a UAE resident ID, raising suspicions of deeper connections in the smuggling ring."
      ],
      "genz_version": "OMG, so actress Ranya Rao just got her bail hearing for that gold smuggling drama postponed until March 14! She was caught with 14 kg of gold, like, at the airport. Her lawyer is saying the DRI totally messed up the arrest, but the DRI is like 'Nah, this is serious business.' Plus, there’s some shady police situation going on that got a CID probe canceled. Major plot twist!",
      "paragraph": "A Bengaluru court is set to announce its decision on actress Ranya Rao's bail plea linked to a gold smuggling case involving 14 kg of gold. The DRI argues against her release, citing a risk to the investigation. Rao claims mistreatment by authorities, while concerns grow over possible police collusion in the smuggling operation."
    }
  },
  {
    "title": "Aamir Khan Goes Public with New Romance!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/aamir-khan-on-secret-romance-with-gauri-spratt-mere-ghar-pe-focus-thoda-kam-hai/articleshow/119032674.cms",
    "image": "https://static.toiimg.com/thumb/msid-119032971,imgsize-26738,width-400,resizemode-4/119032971.jpg",
    "provider": "The Times of India",
    "rawdes": "Bollywood superstar Aamir Khan stunned fans and the media on Thursday, when he went public with his partner of 18 months, Gauri Spratt, at a meet-and-greet event in a Mumbai hotel. The surprise announcement, which came just ahead of his 60th birthday, left many wondering how the superstar managed to start a new romance under the radar. Explaining how he successfully maintained secrecy about his new romance, Khan said, \"For one, she lived in Bangalore until recently, so I would fly down to meet her. The media scrutiny is much less there, which helped us stay under the radar.\" When asked how the paparazzi had missed this, Aamir humorously quipped, \"Mere ghar pe focus thoda kam hai. Aap log miss kar dete ho (The focus is not as much on my house. You guys miss things).\" He then also went on to reveal that he had already introduced his new lady love Gauri to his family and children. When questioned about why he chose to go public with the relationship now, Aamir responded, \"We are committed now, and we felt we were secure enough in each other to tell you guys. And this is better—I won't have to hide things anymore.\" Aamir was previously married to Reena Dutta and Kiran Rao, spending 16 years with each before their respective separations. He shares two children, Junaid and Ira Khan, with Reena. With Kiran, Aamir shares a son, Azad, whom they continue to co-parent post-divorce. The actor disclosed that he and Gauri have known each other for over two decades but reconnected just over a year ago. Amidst buzz about their romance, a video from Irfan’s wedding anniversary party last month began doing the rounds online after fans spotted Gauri in the video. What makes the video even more interesting is the presence of both of Aamir’s ex-wives Reena and Kiran.",
    "news": {
      "key_points": [
        "Aamir Khan reveals his 18-month relationship with Gauri Spratt.",
        "The actor managed to keep the romance private due to Gauri living in Bangalore.",
        "He was previously married to Reena Dutta and Kiran Rao, with whom he shares three children."
      ],
      "detailed_points": [
        "Aamir Khan publicly announced his relationship with Gauri Spratt at a Mumbai event.",
        "He cited lower media scrutiny in Bangalore as a reason for their privacy.",
        "Khan humorously noted that the media tends to overlook his personal life.",
        "Aamir feels secure in his relationship, prompting the decision to go public.",
        "The couple has known each other for over 20 years but reconnected last year."
      ],
      "genz_version": "OMG, Aamir Khan just dropped a major surprise! 😱 He’s been dating Gauri Spratt for 18 months and finally went public at an event in Mumbai! He said they kept it low-key 'cause she was living in Bangalore, like, who would’ve thought? 😂 Plus, he cracked a joke about the paparazzi totally missing his vibes. Now they’re all about that commitment life! 💖",
      "paragraph": "Bollywood superstar Aamir Khan has revealed his relationship with Gauri Spratt, his partner of 18 months, during a Mumbai meet-and-greet. He shared that the couple managed to keep their romance private, partly due to Gauri's residency in Bangalore. Aamir, previously married to Reena Dutta and Kiran Rao, expressed confidence in their commitment, stating they are now ready to share their love publicly."
    }
  },
  {
    "title": "Aamir Khan Goes Public with Girlfriend Gauri Spratt!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/who-is-gauri-spratt-aamir-khan-introduces-his-bengaluru-based-girlfriend/articleshow/119011981.cms",
    "image": "https://static.toiimg.com/thumb/msid-119011950,imgsize-47106,width-400,resizemode-4/119011950.jpg",
    "provider": "The Times of India",
    "rawdes": "Bollywood superstar Aamir Khan recently surprised his fans and the media by introducing his girlfriend, Gauri Spratt, at a pre-birthday event in Mumbai. This move marked a significant moment in his personal life, as he openly discussed his relationship and future plans with Gauri. The couple has been dating for over a year, but their relationship remained under wraps until now. Who is Gauri Spratt? Gauri Spratt hails from Bengaluru and has lived most of her life in that city. She is the daughter of Rita Spratt, who owned a salon in Bengaluru. Gauri studied at Blue Mountain School and later pursued a fashion course, FDA Styling & Photography, from the University of the Arts, London, in 2004. Currently, she manages a BBlunt salon in Mumbai. As per NDTV, Gauri is also a mother to a six-year-old child. See more: Did Gauri Spratt remove her social media account after Aamir Khan’s 60th Birthday leak? Aamir Khan and Gauri Spratt's relationship Aamir Khan and Gauri Spratt have known each other for 25 years, but they started dating about 18 months ago. During this time, they kept their relationship private, with Aamir joking, \"Dekha kuch bhi pata nahi chalne diya maine tum logo ko (See, I did not let you get a wind of this)\". Aamir explained that they decided to go public with their relationship because they felt secure and committed to each other. He said, \"We are committed now, and we felt we were secure enough in each other to tell you guys. And this is better; I won't have to hide things now. Tomorrow, if I go for a coffee with her, you guys can join us, too.\" Gauri has been introduced to Aamir's family and close friends, including fellow actors Shah Rukh Khan and Salman Khan. Aamir's children from his previous marriages have also met Gauri, indicating a harmonious blending of their families. Speaking to Deccan Herald, Gauri Spratt shared that Aamir Khan's family welcomed her warmly. \"They met me with open arms,\" she said, adding, \"I felt very welcomed.\" Her experience was positive, feeling embraced by his family. When questioned about his marriage plans with Gauri, Aamir humorously replied, \"See, we are fully committed. And I have been married twice. Par ab 60 saal ki umar mein shaadi shayad mujhe shobha nahi degi (Marriage at the age of 60 would not suit me). But let's see\" See more: Aamir Khan on getting married for the third time with girlfriend Gauri Spratt: “60 saal ki umar mein shaadi shayad mujhe shobha nahi degi.” Beyond their personal relationship, Gauri has become involved in Aamir's professional life. She is currently working with Aamir Khan Productions, bringing her expertise in fashion and styling to the film industry. Aamir is set to celebrate his 60th birthday today with a family dinner, along with Gauri. Aamir Khan and Gauri Spratt’s public acknowledgment of their relationship marks a new chapter in both their personal lives and professional journeys, as they embrace love and collaboration together. With Gauri's integration into Aamir's family and her involvement in his production work, their bond seems to grow stronger and more harmonious. See more: Who is Gauri Spratt: Aamir Khan introduces his Bengaluru-based girlfriend",
    "news": {
      "key_points": [
        "Aamir Khan introduced girlfriend Gauri Spratt at a pre-birthday event in Mumbai.",
        "The couple has been dating secretly for over a year.",
        "Gauri works at a BBlunt salon and is also a mother."
      ],
      "detailed_points": [
        "Aamir Khan publicly announced his relationship with Gauri Spratt after dating for 18 months.",
        "Gauri, from Bengaluru, has a background in fashion and styling, studying in London.",
        "She manages a salon in Mumbai and has a six-year-old child.",
        "The couple has integrated their families, with Aamir's kids meeting Gauri.",
        "Aamir joked about marriage plans, stating at 60, it might not suit him."
      ],
      "genz_version": "OMG, Aamir Khan just made it Insta-official with his girl, Gauri Spratt, at his bday bash in Mumbai! They’ve been vibing for like 18 months but kept it on the low. Gauri’s a total boss managing a salon and has a kiddo too. Aamir’s fam is all about her, and he's like, 'IDK about marriage at 60 tho, LOL.' Love is in the air! #CoupleGoals",
      "paragraph": "Bollywood superstar Aamir Khan has officially introduced his girlfriend, Gauri Spratt, at a pre-birthday celebration. After keeping their relationship private for over a year, they felt secure enough to go public. Gauri, who hails from Bengaluru and has a background in fashion, has integrated well into Aamir's family. The couple's bond continues to grow as they embrace love and collaboration in their personal and professional lives."
    }
  },
  {
    "title": "Family Scam: 5.7 Crore Coffee Investment Con",
    "link": "https://timesofindia.indiatimes.com/city/hyderabad/60-year-old-duped-of-rs-2-8-crore-by-brother-using-chris-gayles-name/articleshow/119023255.cms",
    "image": "https://static.toiimg.com/thumb/msid-119023300,imgsize-950434,width-400,height-225,resizemode-72/119023300.jpg",
    "provider": "The Times of India",
    "rawdes": "HYDERABAD: A 60-year-old businesswoman filed a criminal complaint against six individuals, including her brother, after being duped into investing 2.8 crore in a fake coffee powder manufacturing company. The investment scheme of Rs 5.7 crore, which promised high returns, turned out to be a scam that has left her and others with significant financial losses. The businesswoman was approached in 2019 by her brother and his wife, who promised her a 4% monthly return on investment. They claimed the money would be used to fund a coffee powder manufacturing company based in Kenya, which was expanding with a new unit in the US. To gain her trust, the accused allegedly showed photos and videos of popular West Indian cricketer Chris Gayle, claiming he was involved in the business as its promoter. “The complainant was told by the accused that the owner of the company is known to them and one of the accused is going to be a partner in the company,” central crime station officials said. Trusting her brother, the businesswoman invested 2.8 crore. She then encouraged family members and friends to invest another 2.2 crore. Others invested 70 lakh, totalling 5.7 crore. Initially, the accused paid returns, convincing investors that the business was legit. However, payments stopped after a period, and when the woman confronted her brother, he claimed their children had confirmed the company’s US unit was operational. Despite requests for updates, the accused kept evading their questions. When the woman confronted her brother, he allegedly hurled abuses at her. The victims, who had invested 5.7 crore, received only 90 lakh in returns.",
    "news": {
      "key_points": [
        "60-year-old woman duped into investing 2.8 crore.",
        "Investment scheme promised 4% monthly returns, linked to fake coffee business.",
        "Total losses for victims amount to 4.7 crore after initial returns ceased."
      ],
      "detailed_points": [
        "A 60-year-old businesswoman filed a complaint against six individuals after losing 2.8 crore to a scam.",
        "The scheme, claiming high returns from a coffee powder company, raised 5.7 crore in total investments.",
        "The businesswoman's brother and his wife first pitched the scheme, using false endorsements from a famous cricketer.",
        "Initial returns convinced investors of legitimacy, but payments eventually stopped.",
        "Victims received only 90 lakh back, with ongoing evasion for updates from the accused."
      ],
      "genz_version": "OMG, fam! So, this 60-year-old businesswoman got totally scammed by her own bro and his crew. She dropped 2.8 crore into this sketchy coffee biz that was all hype and no real grind. They promised her 4% monthly returns, but then ghosted her after she got her fam to invest a total of 5.7 crore! Like, they even used pics of a famous cricketer to flex! Now she’s just out here, only getting 90 lakh back, and drama with the fam is next level. What a mess!",
      "paragraph": "A 60-year-old woman has filed a criminal complaint against her brother and five others after losing 2.8 crore in a fake coffee powder manufacturing scheme that promised high returns. The total investment scam amounted to 5.7 crore, with victims receiving only 90 lakh back after initial returns ceased, leading to significant financial losses and family strife."
    }
  },
  {
    "title": "Doctor Assaults In-Laws: Outrage Erupts Online",
    "link": "https://timesofindia.indiatimes.com/city/bengaluru/viral-video-shows-doc-assaultingher-elderly-in-laws-police-probe/articleshow/119020739.cms",
    "image": "https://static.toiimg.com/thumb/msid-119028408,imgsize-19350,width-400,height-225,resizemode-72/119028408.jpg",
    "provider": "The Times of India",
    "rawdes": "BENGALURU: A video of a doctor and her children purportedly assaulting her aged in-laws over a marital dispute went viral Thursday, sparking outrage on social media with netizens demanding stern action against her. Annapoorneshwarinagar police registered a case against Dr Priyadarshini N, who practices at Victoria Hospital in the city, based on a complaint filed by her father-in-law J Narasimaiah, a resident of RHCS Layout in west Bengaluru. According to him, his son Naveen Kumar, also a doctor, married Priyadarshini in 2007 but they applied for a divorce. She visited Narasimaiah's home around 8:30pm on March 10 along with her daughter and son. She abused him, his wife, and Naveen and allegedly issued death threats. She manhandled them and assaulted Narasimaiah on his head and back. He requested police to take action against her. A senior officer said a case has been registered under the Bharatiya Nyaya Sanhita (BNS) sections 115 (voluntarily causing hurt), 126 (wrongful restraint), 351 (criminal intimidation), and 352 (intentional insult with intent to provoke breach of peace). Since the offences are bailable, her statement will be taken, and a chargesheet will be filed based on the evidence. According to police, the dispute in the family has been ongoing for many years. Priyadarshini claims she visited her husband's home to question him about not taking financial responsibility for their children. She claimed her in-laws provoked her and her children. When she and her children lost patience and reacted, they recorded the video. However, the accusations of both the complainant and the suspects are being verified, the officer added. In the video, Priyadarshini can be seen shouting at people recording the video on their mobiles, dragging her mother-in-law by her hair, and her daughter kicking her grandmother. However, according to a post on X by a handler who uploaded the video, Priyadarshini harassed her in-laws for over a decade. Her mistreatment forced them to leave their own house and live in a rented home. A court ruled that she had no right to visit them, yet on March 10, she and her two children forcibly entered their home and assaulted them. Her father-in-law is a heart patient, and his wife is a survivor of a chronic disease. Priyadarshini has not put out any statement in this regard.",
    "news": {
      "key_points": [
        "Dr. Priyadarshini N. allegedly assaulted her in-laws over a marital dispute.",
        "A viral video shows the confrontation, provoking public outrage.",
        "Police have registered a case under multiple sections of the law."
      ],
      "detailed_points": [
        "The incident occurred on March 10 when Dr. Priyadarshini visited her in-laws' home.",
        "Her father-in-law, J Narasimaiah, filed a complaint detailing the assault.",
        "The family dispute has been ongoing for years, with previous legal rulings against Priyadarshini.",
        "The police case includes charges of hurt, wrongful restraint, and criminal intimidation.",
        "Priyadarshini claims she was provoked and acted in response to her in-laws' behavior."
      ],
      "genz_version": "OMG, so like Dr. Priyadarshini totally pulled up at her in-laws' place and it got wild! She was filmed dragging her mother-in-law by the hair and her kid was kicking, all over some family drama. Now it’s blowing up online and the cops are involved. Apparently, there's been beef for ages and some court said she couldn't even come over. Yikes! What a mess!",
      "paragraph": "Dr. Priyadarshini N., a Bengaluru-based doctor, allegedly assaulted her in-laws during a visit on March 10, triggering widespread outrage following a viral video of the confrontation. Her father-in-law has filed a police complaint, leading to charges against her while both parties' claims are under investigation, revealing a long-standing family dispute and previous court rulings against her visits."
    }
  },
  {
    "title": "John Abraham Scores Big with 'The Diplomat'!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/box-office/the-diplomat-box-office-collection-day-1-john-abraham-starrer-debuts-with-flying-colours-earns-rs-4-crore-on-holi/articleshow/119026715.cms",
    "image": "https://static.toiimg.com/thumb/msid-119026699,imgsize-88810,width-400,resizemode-4/119026699.jpg",
    "provider": "The Times of India",
    "rawdes": "The festival of Holi brought colours of joy and box office success for Bollywood star John Abraham! The actor, highly loved for his action movies, made it to the theatres this Friday with ‘The Diplomat,’ a thriller based on true events. This Shivam Nair directorial chronicles the ordeal of an Indian girl Uzma Ahmed, played by Sadia Khateeb, who gets trapped in Pakistan after being deceived into marriage. John Abraham essays the role of J.P. Singh, the Indian diplomat who plays a crucial part in her rescue. Early predictions regarding the box office collection of the movie hinted at a slow start but ‘The Diplomat’ proved them wrong and had a decent opening at the box office. The Diplomat Movie Review According to the Sacnilk report, the movie opened with Rs.4 crore on March 14, 2025. The festival of Holi may have helped it have a solid start at the box office. With the weekend ahead, the movie is expected to see substantial growth. Also, it is worth noting that ‘The Diplomat’ made a decent opening despite facing a challenge from Vicky Kaushal’s ‘Chhaava.’ This Laxman Utekar movie has been reigning at the box office since day 1, and now after a month, it made Rs 7.25 Crore on the fifth Friday of release (March 14). Considering these numbers, it would not be wrong to say that ‘The Diplomat’ has come up as a solid second choice for cinephiles. Further, if we look at the occupancy rate, on March 14, ‘The Diplomat’ recorded a footfall of 20.45%. The morning shows saw an occupancy of 7.31%, which rose to 19.42% in the afternoon. The percentage further increased, with the evening show witnessing an occupancy rate of 28.50%. It went slightly down in the night shows, with 26.56% occupancy. The maximum occupancy was seen in Chennai - 75.33%. The second best was seen in Bhopal with 29.50%, and Kolkata with 29% followed closely behind. ETimes review for the movie reads, \"John Abraham delivers one of his most nuanced performances as the empathetic and resolute diplomat. He balances quiet authority with wry humour, particularly in moments where he subtly challenges Pakistani officials. \"Yeh Pakistan hai, beta, yahan aadmi aur ghoda seedhi chaal nahi chalta,\" offers a refreshing break from the usual jingoistic rhetoric. Sadia Khateeb portrays Uzma’s vulnerability and resilience with finesse, while Revathy channels the late Sushma Swaraj’s kindness and strength with conviction. Kumud Mishra stands out as Uzma’s sharp yet warm-hearted lawyer, and Jagjeet Sandhu impresses as the deceptively charming yet terrifying Tahir.\"",
    "news": {
      "key_points": [
        "John Abraham's 'The Diplomat' had a strong box office opening.",
        "The film grossed Rs. 4 crore on its release day, March 14, 2025.",
        "Occupancy rates peaked at 75.33% in Chennai."
      ],
      "detailed_points": [
        "'The Diplomat' is a thriller directed by Shivam Nair, based on true events.",
        "John Abraham plays J.P. Singh, an Indian diplomat rescuing an imprisoned girl.",
        "The film's opening coincided with the Holi festival, boosting its box office performance.",
        "It competes against Vicky Kaushal's successful film 'Chhaava', which made Rs. 7.25 crore on the same date.",
        "Critics praised the performances, especially John Abraham's nuanced portrayal of the diplomat."
      ],
      "genz_version": "Yo fam, have you checked out John Abraham's new flick 'The Diplomat'? It dropped on Holi and totally crushed it at the box office with Rs. 4 crore on the first day! 🎉📈 It's like an intense true story where he plays a diplomat saving a girl stuck in Pakistan. Major props to him for that acting! 👏 Plus, Chennai was vibin' with 75% occupancy! #Winning",
      "paragraph": "John Abraham's 'The Diplomat' opened to strong box office numbers, grossing Rs. 4 crore on March 14, 2025, coinciding with the Holi festival. The film, directed by Shivam Nair, tells the story of an Indian girl trapped in Pakistan and features strong performances, particularly Abraham's portrayal of J.P. Singh, the diplomat who helps in her rescue. The film is expected to grow throughout the weekend."
    }
  },
  {
    "title": "Internet Blackout in West Bengal Amid Violence",
    "link": "https://timesofindia.indiatimes.com/city/kolkata/west-bengal-internet-services-suspended-in-parts-of-birbhums-sainthia-till-march-17/articleshow/119029257.cms",
    "image": "https://static.toiimg.com/thumb/msid-119031857,imgsize-362688,width-400,height-225,resizemode-72/119031857.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: Internet and VoIP services have been suspended in five Gram Panchayat areas near Sainthia town in West Bengal’s Birbhum district following reports of violence, according to news agency ANI. Officials announced on Friday that this measure aims to prevent rumour-mongering and illegal activities. The suspension remains active from March 14 (Friday) through March 17 (Monday). The Principal Secretary of Home and Hill Affairs Department, West Bengal Government, issued the directive on March 14, citing worries about potential rumour-spreading that could lead to unlawful activities. Law enforcement personnel have been positioned in the affected localities following reports of stone-pelting incidents in Birbhum. The official directive states: \"Any data related message or class of message to or from any person or class of persons, to or from any telecommunication equipment or class of telecommunication equipment, or relating to any particular subject, brought for transmission by, or transmitted or received by any telecommunication service or telecommunication network under the ambit of Telecommunications Act, 2023, shall temporarily not be transmitted in the interest of maintaining public order and preventing incitement to the commission of any offence.\" The directive clarifies that voice calls and SMS services remain unaffected. Additionally, newspaper circulation continues normally, ensuring that \"communication and dissemination of knowledge and information is not stopped in any way.\" The affected areas include Sainthia, Hatora Gram Panchayat (GP), Mathpalsa GP, Harisara GP, Dariyapur GP, and Fulur GP. The order specifies: \"In view of the recent events in some areas, Internet transmissions and voice over internet telephony maybe used for spreading rumour for unlawful activities in geographical area of Sainthia town area of Sainthia Municipality, Hatora GP, Mathpalsa GP, Harisara GO, Fariyapur GP and Fulur GP area under Sainthia police station of Sainthia community development block in Birbhum Revenue district, under Birbhum police district over the next dfew days and hence the service may be temporarily shut down.\" The restrictions took effect immediately on March 14 and will continue until 8am of March 17. Union minister and West Bengal BJP president Sukanta Majumdar on Saturday criticised the Mamata Banerjee-led state government over the reported clash in Birbhum, accusing the state police of being \"defunct\" and lacking professionalism. Speaking to ANI, Majumdar said, \"We have witnessed such incidents in Birbhum before. Previously, a TMC leader was caught with gelatin sticks, and an NIA inquiry is ongoing. The Mamata Banerjee government has turned Birbhum into a blast factory.\" He also alleged that a significant quantity of explosive material had been seized in Kolkata earlier, with security agencies recovering over 1,000 kg of ammonium nitrate—while the city police remained unaware. \"The West Bengal police have become defunct. They have been politicized to such an extent that they have lost their professionalism and effectiveness,\" Majumdar claimed, blaming the state administration for failing to maintain law and order.",
    "news": {
      "key_points": [
        "Internet and VoIP services suspended in five Gram Panchayats.",
        "Measures taken to prevent rumor-spreading and illegal activities.",
        "Union minister criticizes the state government for public safety issues."
      ],
      "detailed_points": [
        "Internet and VoIP services in Sainthia, West Bengal suspended from March 14 to March 17.",
        "The decision aims to curb violence and prevent rumors related to recent unrest.",
        "Voice calls and SMS services remain active, and newspapers continue regular circulation.",
        "Sukanta Majumdar, BJP president in West Bengal, calls out the state police’s ineffectiveness.",
        "The directive stems from concerns over potential unlawful activities and public disorder."
      ],
      "genz_version": "Yo fam, so Sainthia in West Bengal is going full blackout with the internet from March 14 to 17 because of some crazy violence. They’re trying to stop the rumor mill from spinning wild and keep things chill. Calls and texts are still a go, but the BJP dude is totally dragging the state police through the mud for being all talk and no action. It's a whole mood!",
      "paragraph": "Internet and VoIP services have been suspended in five Gram Panchayats near Sainthia, West Bengal, from March 14 to 17, following violence reports. This action is intended to prevent rumor-mongering and illegal activities. While voice calls and SMS are unaffected, the BJP leader criticized the state government for the situation, alleging police inefficiency and prior incidents of unrest in the area."
    }
  },
  {
    "title": "Epic Games CEO Backs Musk on Tesla Protests",
    "link": "https://timesofindia.indiatimes.com/technology/tech-news/elon-musks-claim-that-george-soros-reid-hoffman-herbert-sandler-behind-tesla-protests-gets-angry-one-word-agreement-from-fortnite-maker-ceo/articleshow/118972517.cms",
    "image": "https://static.toiimg.com/thumb/msid-118972577,imgsize-492142,width-400,resizemode-4/118972577.jpg",
    "provider": "The Times of India",
    "rawdes": "Fortnite-maker Epic Games CEO Tim Sweeney has publicly thrown his weight behind Elon Musk's claims that the nationwide protests against Tesla are part of a coordinated effort backed by billionaire donors, including George Soros and LinkedIn co-founder, former executive chairman of LinkedIn Reid Hoffman and others. Responding to Musk’s post on X (formerly Twitter) that suggested Soros, Hoffman, Herbert Sandler, Patricia Bauman and Leah Hunt-Hendrix were behind the anti-Tesla demonstrations, Sweeney wrote \"Disgusting,\" appearing to agree with Musk's characterisation of the situation. Tim Sweeney connects Tesla protests with Epic Games’ legal battle against Google, Apple When questioned about his stance, Sweeney defended his position by referencing his experience with Epic Games' legal battle against the Big Tech – a typical reference to the five US tech companies: Alphabet, Amazon, Apple, Meta and Microsoft. “Elon made a simple statement of fact and I have firsthand experience with Big Tech companies paying dozens of lobbyists and front groups to smear my company while concealing or misrepresenting their allegiance to their paymasters. It needs to stop,” he said. “Megacorps and plutocrats are free to have their dumb opinions and to express them. That’s their right. The problem here is the multibillion dollar web of deception they fund to misrepresent their dumb ideas as organic or popular movements when they are just the opposite,” he added. “And then you have the violent fringe around such astroturfing campaigns which increasingly appears to be an intended feature, not a bug,” Sweeney said. Why there are protests against Elon Musk’s Tesla The protests against Tesla have been growing across multiple countries, reflecting Musk’s involvement in political activities. These demonstrations have occurred at Tesla showrooms and facilities in various locations. In New York City, several protesters were arrested outside a Tesla dealership, with some chanting, “We need clean air, not another billionaire.” Tesla owners have begun displaying bumper stickers with messages like “Bought it before we knew how awful he is” and “Stuck with Tesla, not stuck on Elon.”",
    "news": {
      "key_points": [
        "Tim Sweeney, CEO of Epic Games, supports Elon Musk's claims about protests against Tesla being orchestrated by billionaires.",
        "Sweeney shares his experiences with Big Tech lobbying against his company during a legal battle.",
        "Protests against Tesla are increasing globally, with activists demanding accountability from Musk."
      ],
      "detailed_points": [
        "Sweeney tweeted 'Disgusting' in response to Musk's allegations about billionaire involvement in Tesla protests.",
        "He criticized the deceptive practices of Big Tech in promoting their narratives through lobbying.",
        "Protests have included visible demonstrations at Tesla locations, showing public dissent against Musk's actions.",
        "Some Tesla owners are expressing their discontent through bumper stickers criticizing Musk.",
        "The protests reflect broader concerns about Musk's political engagement and corporate influence."
      ],
      "genz_version": "Yo, Tim Sweeney from Epic Games is totally vibing with Elon Musk's take that the protests against Tesla are backed by rich peeps like Soros. He’s been through the whole Big Tech drama and knows the lobby game is real. Protests are popping off everywhere, and Tesla owners are slapping on stickers like, 'We need clean air, not another billionaire.' It’s gettin’ messy out there!",
      "paragraph": "Tim Sweeney, CEO of Epic Games, endorsed Elon Musk's assertion that recent protests against Tesla are funded by billionaires like George Soros. He shared his own experiences with lobbying tactics used by Big Tech during legal disputes. Protests are intensifying worldwide, with demonstrators voicing their frustrations at Tesla facilities, leading some owners to express dissent via bumper stickers targeting Musk directly."
    }
  },
  {
    "title": "Chhaava Roars Back at Box Office!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/box-office/chhaava-box-office-collection-day-29-vicky-kaushals-film-starts-5th-week-strongly-earns-rs-7-25-cr-on-holi/articleshow/119028072.cms",
    "image": "https://static.toiimg.com/thumb/msid-119028099,imgsize-87996,width-400,resizemode-4/119028099.jpg",
    "provider": "The Times of India",
    "rawdes": "Just when it seemed that Vicky Kaushal’s historical drama ‘Chhaava ’ was ready to loosen its grip over the box office, the film’s day 29 collection proved otherwise. The Laxman Utekar directorial ‘Chaava’ saw some drop in the business in its 4th week; however, with the Holi, which marked its fifth Friday, the movie gained back the momentum and showed a rise of more than 60 percent. According to Sacnilk report, the movie made around Rs. 7.25 Cr (Hindi: Rs 6.5 Cr; Telugu: Rs 0.75 Cr) on its fifth Friday, taking the film’s total to Rs 546.75 Cr (Hindi: Rs. 534.45 Cr; Telugu: Rs 12.55 Cr). Chhaava Movie Review Starring Vicky Kaushal, Rashmika Mandanna, Viineet Kumar Singh, Divya Dutta, Ashutosh Rana and more, the movie started very strongly. The opening weekend and the entire first week recorded some impressive numbers. By the end of week 1, the movie stood at Rs.219.25 Cr. The second week maintained a momentum of Rs.180.25 Cr collection. However, the numbers started dropping from week 3 and saw a major dip in week 4. Nevertheless, the start of the fifth week promises a better collection, especially with the weekend ahead. India's net box office collection of ‘Chhaava’ Week 1 Collection: ₹ 219.25 Cr Week 2 Collection: ₹ 180.25 Cr Week 3 Collection: ₹ 84.05 Cr Day 22 [4th Friday]: ₹ 8.75 Cr [Hindi: ₹ 6.25 Cr; Telugu: ₹ 2.5 Cr] Day 23 [4th Saturday]: ₹ 16.75 Cr [Hindi: ₹ 13.5 Cr; Telugu: ₹ 3.25 Cr] Day 24 [4th Sunday]: ₹ 10.75 Cr [Hindi: ₹ 8.5 Cr; Telugu: ₹ 2.25 Cr] Day 25 [4th Monday]: ₹ 5.25 Cr [Hindi: ₹4 Cr; Telugu: ₹ 1.25 Cr] Day 26 [4th Tuesday]: ₹ 5.15 Cr [Hindi: ₹ 4.15 Cr; Telugu: ₹ 1 Cr] Day 27 [4th Wednesday]: ₹ 4.8 Cr [Hindi: ₹ 4 Cr ; Telugu: ₹ 0.8 Cr] Day 28 [4th Thursday]: ₹ 4.5 Cr [Hindi: ₹ 3.75 Cr; Telugu: ₹ 0.75 Cr] Week 4 Collection: ₹ 55.95 Cr [Hindi: ₹ 44.15 Cr; Telugu: Rs.11.8] Day 29 [5th Friday]: ₹ 7.25 Cr [Hindi: ₹ 6.5 Cr; Telugu: ₹ 0.75 Cr] (rough data) Total: ₹ 546.75 Cr (Hindi: ₹ 534.45 Cr; Telugu: ₹ 12.55 Cr) Inspired by the novel of the same name, ‘Chhaava’ showcases the life of Chhatrapati Sambhaji Maharaj, the son of Chhatrapati Shivaji Maharaj. Chaava was the second ruler of the Maratha Empire, who continued the legacy of Swaraj established by his father. Although he was ultimately captured by Mughal Emperor Aurangzeb, the relentless torture he endured could not undermine the spirit of the Maratha warrior. ETimes review for the movie reads, \"Chhaava’s redeeming factor is its terrific climax. Vicky Kaushal is breathtaking as he exudes Sambhaji Maharaj’s valour and passion for swarajya (self-rule) like it were his second skin. You just wish the film relied and trusted its story more than Rahman's music, which largely feels out of place.\"",
    "news": {
      "key_points": [
        "Chhaava's fifth Friday collection surged to ₹7.25 Cr.",
        "Total box office earnings reached ₹546.75 Cr to date.",
        "Vicky Kaushal stars in this historical drama about Chhatrapati Sambhaji Maharaj."
      ],
      "detailed_points": [
        "Directed by Laxman Utekar, Chhaava has shown resilience at the box office.",
        "Despite a dip in collections during weeks 3 and 4, Holi weekend gave the film a boost.",
        "The film’s impressive opening saw it gross ₹219.25 Cr in the first week.",
        "Critics praise Kaushal's performance, highlighting the film's climax as a standout.",
        "Chhaava portrays the life of Chhatrapati Sambhaji Maharaj and his legacy in the Maratha Empire."
      ],
      "genz_version": "Yo fam, Chhaava is totally back on the box office grind! 💥 It snagged ₹7.25 Cr on its fifth Friday, making the total a lit ₹546.75 Cr. 📈 After some rough weeks, the Holi vibes gave it a sick boost! 🎉 People are vibing with Vicky Kaushal's epic portrayal of Sambhaji Maharaj. Don’t sleep on this film, it’s got a dope climax too! 🔥",
      "paragraph": "Vicky Kaushal's film Chhaava has made a notable comeback at the box office, earning ₹7.25 Cr on its fifth Friday, pushing its total to ₹546.75 Cr. After an initial strong performance, the film faced declining numbers in weeks 3 and 4. However, the Holi weekend revitalized its earnings, with critics praising Kaushal's powerful portrayal of Chhatrapati Sambhaji Maharaj."
    }
  },
  {
    "title": "Holi Political Invite: Congress to Shinde and Pawar",
    "link": "https://timesofindia.indiatimes.com/city/nagpur/bura-na-mano-holi-hai-nana-patole-asks-deputy-cms-ajit-pawar-eknath-shinde-to-join-mva/articleshow/119034330.cms",
    "image": "https://static.toiimg.com/thumb/msid-119034766,imgsize-27516,width-400,height-225,resizemode-72/119034766.jpg",
    "provider": "The Times of India",
    "rawdes": "NAGPUR: Former Maharashtra Congress president Nana Patole on Friday added political colour to Holi hue with a bold invite to deputy chief ministers Eknath Shinde and Ajit Pawar to form a govt without CM Devendra Fadnavis, if they face suffocated under his leadership. Taking a swipe at the state’s ruling alliance while delivering Holi greetings in Nagpur, Patole suggested Congress is willing to collaborate with Shinde and Pawar if tensions with Fadnavis escalate. “If Devendra Fadnavis is troubling you, we are ready to stand with you and form a govt together,” he declared, signalling a potential shift in Maharashtra’s political landscape. Talking to TOI, Patole said, the statement was made in a lighter vein for Holi. “I made a statement telling them Bura Na Mano Holi Hai. However, if Shinde and Ajit Pawar want to come, we will embrace them,” he said. State Congress president Harshvardhan Sapkal refused to elaborate on Patole’s statement or answer TOI’s query on whether he was on the same page with the former state party chief. “Burra na mano Holi hai. I won’t speak further,” he told TOI. Speaking to the news channel, Patole criticized Shinde and Pawar for allegedly altering their political approach since aligning with Prime Minister Narendra Modi. “Earlier, these two leaders prioritized Maharashtra’s development and collaborated across party lines. But after coming under Modi’s influence, they’ve started exaggerating and distorting facts,” he remarked. “I urge them to spurn negativity and focus on welfare of the people,” he added. The offer comes amidst reports of friction between Fadnavis and his two deputies, fuelling speculation about cracks within the tripartite Maharashtra government. Not sparing the chief minister, Patole accused Fadnavis of misleading the public with false claims. “My friend Fadnavis has been lying a lot lately. I hope he stops spreading falsehoods and focuses on real issues,” he quipped. Responding to rumours of internal rifts within Congress, Patole asserted the party remains united and ticket distribution for upcoming elections was handled amicably. He specifically praised senior Congress leader Vijay Wadettiwar, calling him “superfast” and encouraging him to accelerate his political efforts. Responding to Patole's comments, BJP state president Chandrashekhar Bawankule told TOI that Patole should look within. “Maharashtra’s citizens have given a massive mandate to Mahayuti. Patole himself scraped through to win his Sakoli seat. He should strengthen his own party first and play the role of a responsible opposition party,” he said. In a rare display of appreciation across party lines, Patole commended Sena (UBT) leader Sanjay Raut as an “intellectual powerhouse” whose wisdom continues to shape the state’s political discourse. He also acknowledged former Chief Minister Uddhav Thackeray as a guiding figure, reinforcing the long-standing political ties between Congress and the Sena faction. Patole's open offer to Shinde and Pawar not only highlights increasing tensions within Maharashtra govt, but also signals Congress’ readiness to play a decisive role if the state’s political equation changes. (Inputs from Dhananjay Sable, Akola)",
    "news": {
      "key_points": [
        "Nana Patole invites Shinde and Pawar to form a government without Fadnavis.",
        "Patole's comments suggest potential rifts within Maharashtra's ruling alliance.",
        "BJP's Chandrashekhar Bawankule criticizes Patole's opposition stance."
      ],
      "detailed_points": [
        "Former Congress president Nana Patole offered to collaborate with deputy chief ministers Eknath Shinde and Ajit Pawar if they feel hindered by Chief Minister Fadnavis.",
        "His comments were made during Holi celebrations in Nagpur and were described as lighthearted.",
        "This statement indicates growing tensions within the tripartite Maharashtra government.",
        "Patole also criticized Shinde and Pawar for altering their political priorities under Modi's influence.",
        "In response, BJP leader Bawankule urged Patole to focus on strengthening his own party."
      ],
      "genz_version": "Yo, so Nana Patole just threw some mad shade during Holi, inviting Shinde and Pawar to ditch Fadnavis if they’re feeling cramped. He was like, 'Bura Na Mano Holi Hai!' 😂 But for real, things are kinda tense in Maharashtra’s ruling squad, and even Bawankule from BJP clapped back at him, saying he should get his own house in order first. Political drama all around! 🎉",
      "paragraph": "During Holi celebrations in Nagpur, former Maharashtra Congress president Nana Patole extended an invitation to deputy chief ministers Eknath Shinde and Ajit Pawar to join forces and form a government without Chief Minister Fadnavis, hinting at potential divisions within the ruling alliance. While his remarks were made in jest, they underline the shifting political landscape in Maharashtra amidst rising tensions."
    }
  },
  {
    "title": "Saif's Awkward Kiss Moment with Rani Revealed",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/when-saif-ali-khan-recalled-his-awkward-on-screen-kiss-with-rani-mukerji-it-was-the-worst-kiss-in-the-history-of-cinema/articleshow/119023513.cms",
    "image": "https://static.toiimg.com/thumb/msid-119023513,imgsize-64934,width-400,resizemode-4/119023513.jpg",
    "provider": "The Times of India",
    "rawdes": "Saif Ali Khan began his acting career in 1993 with the film 'Parampara'. Following his debut, he went on to work in several successful movies, never looking back. Throughout his career, Saif has collaborated with numerous renowned actresses, often creating amazing on-screen chemistry that captivated audiences. However, there was one instance where he felt uneasy during a kissing scene with a particular actress. As reported by Hindustan Times, in a throwback YouTube video released by Yash Raj Films, Saif and Rani discussed their awkward kissing scene in the movie 'Hum Tum'. Rani asked Saif if he recalled how nervous they were during the scene. Saif playfully responded that Rani was the one who was scared. He humorously noted, \"I remember how scared you were to do the kissing shot.\" In the same video, Saif recalled how Rani was friendly that day, trying to convince him to tell the filmmakers that he didn't want to do the kiss. Saif recalled Rani's request, saying, \"You said, ‘Listen, you say that you don’t want to kiss me.’ So I said, ‘I can’t say that! My boss has told me, so I have to do it.’ You said, ‘Listen, I don’t think we should do it.'\" Khan also described that it was extremely uncomfortable, primarily because Rani was uneasy during the scene. In his words, \"It was the worst kiss in the history of cinema; it was so uncomfortable. It made me so uncomfortable because you were so uncomfortable.\" In his personal life, Saif Ali Khan is married to Kareena Kapoor Khan, and they have two sons, Taimur Ali Khan and Jehangir Ali Khan. The couple tied the knot in 2012 after dating for several years. Saif also has two older children from his previous marriage to Amrita Singh, Sara Ali Khan and Ibrahim Ali Khan.",
    "news": {
      "key_points": [
        "Saif Ali Khan and Rani Mukerji discussed their awkward kiss in 'Hum Tum'.",
        "Saif humorously recalled Rani's nervousness during the scene.",
        "He described the kiss as 'the worst in cinema history' due to discomfort."
      ],
      "detailed_points": [
        "Saif Ali Khan's acting career began in 1993 with 'Parampara'.",
        "He reminisced about a kissing scene with Rani Mukerji in 'Hum Tum'.",
        "In a YouTube video, Saif shared how Rani was nervous and suggested he avoid the kiss.",
        "Saif defended his commitment to the scene as per the director's orders.",
        "The candid discussion highlights the challenges actors face during intimate scenes."
      ],
      "genz_version": "So, like, Saif Ali Khan just spilled the tea about that super awkward kiss with Rani in 'Hum Tum'. 😂 In a throwback vid, he totally called her out for being nervous, saying it was the 'worst kiss ever'! Rani even tried to get him to bail on the scene. Can you imagine? Such a vibe! 😅💔",
      "paragraph": "Saif Ali Khan and Rani Mukerji recently shared a humorous throwback about their awkward kissing scene in 'Hum Tum'. In a YouTube interview, Saif recalled Rani's nervousness and how she suggested he tell the filmmakers he didn’t want to kiss her. He humorously declared it 'the worst kiss in cinema history' due to their mutual discomfort during filming."
    }
  },
  {
    "title": "Aamir Khan's New Love at 60!",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/aamir-khan-introduces-his-girlfriend-gauri-on-his-60th-birthday-requests-paparazzi-not-to-click-her-photos/articleshow/118980208.cms",
    "image": "https://static.toiimg.com/thumb/msid-118980208,imgsize-47196,width-400,resizemode-4/118980208.jpg",
    "provider": "The Times of India",
    "rawdes": "On his 60th birthday, Aamir Khan introduced the world to his new love. For those unaware, he was previously married to Reena Dutta (1986-2002) and later to Kiran Rao (2005-2021). He has two grown children, Ira and Junaid, from his first marriage and a 12-year-old son, Azad, from his second. Love knows no age, and Aamir Khan proved it by finding love at 60. His daughter, Ira, married in 2024, while his son, Junaid, recently made his grand silver screen debut. On March 13, 2025, during an informal birthday celebration, Aamir introduced his new girlfriend, Gauri, to the paparazzi. When Aamir Khan and his ex-wife Kiran Rao appeared at News18 India Chaupal, they spoke about working together after their divorce. Aamir questioned whether a couple should become enemies after separating. He expressed gratitude for their journey together and emphasized that they remain emotionally connected as a family, both personally and professionally. Aamir Khan married Reena Dutta in 1986, and they parted ways in 2002 but remained cordial for their children, Ira and Junaid. He later fell in love with Kiran Rao, who was an assistant director on Lagaan. After dating for a few years, they married in 2005 but announced their separation after 11 years. As Aamir Khan embarks on this new chapter with Gauri, it’s clear that love remains a powerful force in his life, proving that it truly knows no age.",
    "news": {
      "key_points": [
        "Aamir Khan introduces new girlfriend Gauri on his 60th birthday.",
        "He was previously married to Reena Dutta and Kiran Rao.",
        "Khan emphasizes emotional connection with ex-wife Kiran for their children."
      ],
      "detailed_points": [
        "Aamir Khan, on his 60th birthday, unveiled his new girlfriend Gauri.",
        "He has two children, Ira and Junaid, from his first marriage and a son, Azad, from his second.",
        "Ira married in 2024, and Junaid made a film debut recently.",
        "During a recent event, Aamir discussed maintaining a cordial relationship with ex-wife Kiran Rao.",
        "He expressed that love persists regardless of age, marking a new chapter in his life."
      ],
      "genz_version": "Yo, guess what? Aamir Khan just dropped the news about his new gf Gauri on his 60th bday! 🌟 After two marriages, he’s vibing with love again. His kids are all grown up, with Ira tying the knot in 2024 and Junaid hitting the movies. Talk about living your best life! 😂 Aamir’s all about staying friends with the ex, Kiran, too. Love is straight-up ageless! 💖",
      "paragraph": "On his 60th birthday, Aamir Khan introduced his new girlfriend Gauri, celebrating love's timelessness. Previously married to Reena Dutta and Kiran Rao, Aamir has three children. During a recent event, he highlighted the importance of staying connected with ex-partners for the sake of family. Aamir's new relationship represents a hopeful new chapter in his life."
    }
  },
  {
    "title": "Priyanka & Nick's Holi Celebrations: A Colorful Journey",
    "link": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/when-priyanka-chopra-and-nick-jonas-took-holi-very-seriouslya-look-back-at-their-festive-celebrations/articleshow/119009047.cms",
    "image": "https://static.toiimg.com/thumb/msid-119009040,imgsize-53828,width-400,resizemode-4/119009040.jpg",
    "provider": "The Times of India",
    "rawdes": "As Holi 2025 brings joy across the globe, let's take a nostalgic trip back to Priyanka Chopra and Nick Jonas' vibrant Holi celebrations from previous years. The couple, known for embracing Indian traditions with enthusiasm, hosted grand Holi parties filled with colors, laughter, and Bollywood-style festivity. In 2023, Priyanka and Nick celebrated the festival of colors in Los Angeles, throwing an extravagant Holi bash. The star-studded event was attended by actress Preity Zinta and her husband, Gene Goodenough, among others. Priyanka later shared a fun moment from the event on her Instagram Stories, featuring Nick playfully throwing colored powder at her. Drenched in hues, Priyanka appeared to be screaming in surprise. Sharing the photo, she wrote, \"Happy Holi to all celebrating! As you can tell, we take it very seriously,\" tagging her husband Nick Jonas. The following year, in 2024, their Holi celebration turned into a wholesome family affair. Priyanka shared heartwarming pictures of herself with daughter Malti Marie and Nick Jonas, all dressed in white, ready for a splash of colors. Her mother, Madhu Chopra, and cousin Mannara Chopra, fresh from her stint on Bigg Boss, were also seen enjoying the festivities. Expressing her joy, Priyanka wrote, \"Holi was lit. Thank you @tam2cul @sudeepdutt for creating such a warm atmosphere for our family! So much fun.\" On the work front, Priyanka Chopra is all set for her biggest film yet! She will be seen teaming up with the ‘RRR’ director SS Rajamouli, and the film stars Mahesh Babu and Prithviraj Sukumaran in pivotal lead roles. The film has many expectations from the audiences.",
    "news": {
      "key_points": [
        "Priyanka Chopra and Nick Jonas celebrated Holi in LA in 2023.",
        "Their 2024 celebration featured family, including daughter Malti Marie.",
        "Priyanka is set to star in a high-profile film directed by SS Rajamouli."
      ],
      "detailed_points": [
        "In 2023, Priyanka and Nick hosted a star-studded Holi party in Los Angeles.",
        "Guests included actress Preity Zinta and her husband, Gene Goodenough.",
        "Priyanka shared fun moments on Instagram, showcasing their festive spirit with colors.",
        "The 2024 celebration was a family affair, with Priyanka and Nick's daughter joining in.",
        "Priyanka is preparing for a major film project alongside renowned director SS Rajamouli."
      ],
      "genz_version": "OMG, y'all! Priyanka and Nick are like, total Holi goals! 🎉 Last year, they threw a sick bash in LA with celebs like Preity Zinta. This year? Full fam vibes—dressing in white and getting all colorful with lil Malti Marie. ✨ And, get this, Priyanka's about to slay in a movie with the RRR director! Major hype! 🎬💖",
      "paragraph": "Priyanka Chopra and Nick Jonas have been known for their vibrant Holi celebrations. In 2023, they hosted a star-studded party in Los Angeles with notable guests like Preity Zinta. The following year, their festivities became a family event, featuring their daughter Malti Marie. Currently, Priyanka is gearing up for an exciting film directed by SS Rajamouli, raising audience expectations."
    }
  },
  {
    "title": "PIA Flight Lands Missing a Wheel!",
    "link": "https://timesofindia.indiatimes.com/world/pakistan/pakistan-international-airlines-flight-lands-in-lahore-with-one-rear-wheel-missing/articleshow/119030952.cms",
    "image": "https://static.toiimg.com/thumb/msid-119031293,imgsize-705492,width-400,resizemode-4/119031293.jpg",
    "provider": "The Times of India",
    "rawdes": "A Pakistan International Airlines (PIA) domestic flight landed at Lahore airport with a missing wheel, as confirmed by an official. The incident occurred during Thursday morning's landing. The PIA flight PK-306, travelling from Karachi to Lahore, was discovered to have a missing rear wheel upon landing at Lahore airport, according to the official. A PIA official informed news agency PTI that an investigation had commenced. They are examining whether the aircraft departed Karachi without the wheel or if it detached during take-off. \"It appears that one of the rear wheels was in shabby condition when the aircraft took off,\" the official said. Meanwhile, a PIA spokesperson stated that Airlines' flight safety and Lahore airport teams are investigating the incident and will present their findings. He assured that the aircraft's design accounts for such situations, ensuring passenger and equipment safety. The investigation will also consider the unlikely possibility of wheel theft, as mentioned by the spokesperson. The PK-306 completed a normal landing as scheduled, according to the spokesperson. Passengers disembarked normally, and the missing wheel was noticed during the captain's routine walk-around inspection. The aircraft's main landing gear was missing one of its six wheels.",
    "news": {
      "key_points": [
        "PIA flight PK-306 landed in Lahore with a missing rear wheel.",
        "Investigation launched to determine if wheel was lost during takeoff or landing.",
        "Passengers disembarked safely; the missing wheel was discovered during a routine inspection."
      ],
      "detailed_points": [
        "The incident occurred during the landing of PIA flight PK-306 from Karachi to Lahore.",
        "An official stated one of the rear wheels was in poor condition before takeoff.",
        "An investigation is underway to check the condition of the aircraft and whether any theft occurred.",
        "A PIA spokesperson confirmed that the aircraft's design ensures passenger safety in such cases.",
        "No injuries reported as the flight completed a normal landing, and passengers disembarked without issues."
      ],
      "genz_version": "So, get this: a PIA flight from Karachi touched down in Lahore, but like, one of its rear wheels was totally AWOL! 😱 They’re trying to figure out if it ghosted during takeoff or was just in bad shape. The flight landed without a hitch, and all the peeps got off fine. The crew found out about the wheel missing while doing a routine check. Crazy, right? #PIA #WheellessLanding",
      "paragraph": "A Pakistan International Airlines flight PK-306 landed safely at Lahore airport with a missing rear wheel after departing from Karachi. An investigation is underway to find out if the wheel was lost in flight or was already damaged pre-takeoff. The flight landed normally, and passengers disembarked safely, with the missing wheel discovered during a post-landing inspection."
    }
  },
  {
    "title": "Budget Cuts Hit Welfare for Ladki Bahin Scheme",
    "link": "https://timesofindia.indiatimes.com/city/mumbai/social-justice-tribal-department-funds-cut-given-to-ladki-yojana/articleshow/119035507.cms",
    "image": "https://static.toiimg.com/thumb/msid-119035999,imgsize-103252,width-400,height-225,resizemode-72/119035999.jpg",
    "provider": "The Times of India",
    "rawdes": "MUMBAI: Financial strain caused by Mahayuti's Ladki Bahin Yojana appears to be showing in reduced allocations for some welfare departments in the budget. Red-flagging this, Shiv Sena's social justice minister Sanjay Shirsat said, \"My information is that nearly Rs 10,000 crore - Rs 7,000 crore from social justice and Rs 3,000 crore from tribal development - has been diverted for Ladki Bahin.\" While funds for SC and ST components were hiked 40-42% in the overall annual plan, social justice, tribal development and other backward Bahujan welfare departments saw a drop. A top bureaucrat confirmed the reallocation of funds from the social justice and tribal development departments for the Ladki Bahin scheme. \"Funds must have been transferred for SC/ST beneficiaries under the scheme,\" the bureaucrat said in a message to TOI.",
    "news": {
      "key_points": [
        "Rs 10,000 crore diverted for Mahayuti's Ladki Bahin Yojana.",
        "Social justice and tribal development departments face budget cuts.",
        "Bureaucrat confirms reallocation of funds for SC/ST beneficiaries."
      ],
      "detailed_points": [
        "The Ladki Bahin Yojana has led to a significant diversion of funds, including Rs 7,000 crore from social justice and Rs 3,000 crore from tribal development.",
        "While allocations for SC and ST components increased by 40-42%, other welfare departments saw reductions.",
        "Shiv Sena's social justice minister Sanjay Shirsat raised concerns about the funding shift.",
        "A top bureaucrat acknowledged the transfer of funds to support beneficiaries under the Ladki Bahin scheme.",
        "The budget adjustments have sparked discussions about the prioritization of welfare programs."
      ],
      "genz_version": "Yo fam, peep this! Maharashtra's budget just took a hit 'cause of the Ladki Bahin Yojana. They’ve slashed Rs 10,000 crore from social justice and tribal deets for it! Social justice guy Sanjay Shirsat is low-key stressing about it. Like, SC/ST cash got a boost but other welfare stuff is vibing down. A bureaucrat spilled the tea on the fund transfers too. Major budget drama!",
      "paragraph": "The budget for Maharashtra has been affected by the Ladki Bahin Yojana, with Rs 10,000 crore diverted from social justice and tribal development departments. While funding for SC and ST components increased, welfare departments catering to backward classes have faced cuts. Concerns were raised by Shiv Sena's Sanjay Shirsat, and a bureaucrat confirmed the reallocation of funds for beneficiaries under the scheme."
    }
  },
  {
    "title": "India Slams Pakistan at UN Over Kashmir Claims",
    "link": "https://timesofindia.indiatimes.com/india/fanatical-mindset-india-slams-pakistan-in-un-over-unjustified-reference-to-jk/articleshow/119029298.cms",
    "image": "https://static.toiimg.com/thumb/msid-119030447,imgsize-687482,width-400,resizemode-4/119030447.jpg",
    "provider": "The Times of India",
    "rawdes": "NEW DELHI: India raised strong objections against Pakistan's mention of Jammu and Kashmir at the UN General Assembly, emphasising that such statements doesn't substantiate their territorial claims. \"As is their habit, the former foreign secretary of Pakistan today has made an unjustified reference to the Indian Union Territory of Jammu and Kashmir,\" stated India's Permanent Representative to the UN, Ambassador P Harish, during Friday's General Assembly meeting, which was held to observe the International Day to combat Islamophobia. Harish added that that Pakistan's repeated mentions would \"neither validate their claim nor justify their practice of cross-border terrorism\". \"The fanatical mindset of this nation is well known, as also its record of bigotry. Such efforts will not change the reality that Jammu and Kashmir was, is and will always be an integral part of India,\" he declared. This forceful response followed Pakistan's former foreign secretary, Tehmina Janjua's references to Jammu and Kashmir during the informal gathering commemorating the International Day to Combat Islamophobia. The Permanent Mission of India to the United Nations shared further details on the ambassador \"delivering India's statement\". Talking about Islamophobia, Harish added to his statement, \"India stands united with the UN membership in condemning incidents of religious intolerance against Muslims.\" \"It is imperative to recognize that religious discrimination is a broader challenge that affects followers of all faiths,\" also said P Harish adding that, \"Any deliberation on issues of faith must seek to unite , not divide.\" India's criticism on Pakistan at the UN comes after Pakistan suggested India's involvement in the recent train hijacking in Balochistan, to which the ministry of external affairs (MEA) released a statement, rejecting 'baseless allegations' and asked their neighbour to look inwards for 'its own internal problems.' MEA official spokesperson Randhir Jaiswal responded to media queries regarding remarks made by the Pakistan side, saying, \"We strongly reject the baseless allegations made by Pakistan. The whole world knows where the epicenter of global terrorism lies. Pakistan should look inwards instead of pointing fingers and shifting the blame for its own internal problems and failures on to others.\" Read more: MEA rejects Pakistan’s claim of India's role in train hijacking The attack on the Jaffar Express on March 11, which was carrying more than 450 passengers, led to 58 deaths, comprising 21 passengers, four soldiers, and 33 militants belonging to the Balochistan Liberation Army (BLA), a separatist group. Pakistan regularly claims that India provides support to organisations such as the BLA to foment instability in Balochistan, charges that New Delhi categorically rejects.",
    "news": {
      "key_points": [
        "India objected to Pakistan's Kashmir claims at the UN.",
        "Ambassador P Harish called Pakistan's statements unjustified.",
        "India rejected Pakistan's allegations regarding involvement in Balochistan."
      ],
      "detailed_points": [
        "India raised strong objections to Pakistan's claims about Jammu and Kashmir during a UN meeting.",
        "Ambassador P Harish stated that Pakistan's references do not legitimize their territorial claims.",
        "India emphasized its unity with the UN in condemning religious intolerance.",
        "The Ministry of External Affairs rejected Pakistan's accusations of India's involvement in a recent train hijacking.",
        "The incident in question resulted in 58 deaths and involved the Balochistan Liberation Army."
      ],
      "genz_version": "Yo, so India just straight-up roasted Pakistan at the UN over their wild claims about Kashmir. Amb P Harish was like, 'Nah, fam, that ain't true!' Plus, India is all about supporting Muslims against hate. And when Pakistan threw shade about India being behind that train hijack, MEA was like, 'Chill, focus on your own mess instead!'",
      "paragraph": "India strongly rebuffed Pakistan's assertions about Jammu and Kashmir at the UN, asserting the region's integral status to India. Ambassador P Harish labeled Pakistan's references as unjustified and reiterated India's solidarity against religious intolerance. In response to allegations regarding involvement in a train hijacking, India dismissed Pakistan's claims, urging them to confront their internal issues instead."
    }
  }
]
